{
  "intents": [
      {
          "tag": "greeting",
          "patterns": [
              "Hi",
              "Hey",
              "Is anyone there?",
              "Hi there",
              "Hello",
              "Hey there",
              "Howdy",
              "Hola",
              "Bonjour",
              "Konnichiwa",
              "Guten tag",
              "Ola",
              "Namaste",
              "Salut",
              "Ciao",
              "Sawubona"
          ],
          "responses": [
              "Hello there. Tell me how are you feeling today?",
              "Hi there. What brings you here today?",
              "Hi there. How are you feeling today?",
              "Great to see you. How do you feel currently?",
              "Hello there. Glad to see you're back. What's going on in your world right now?",
              "Namaste. How are you doing today?",
              "Salut! How can I assist you today?",
              "Ciao! What's on your mind?",
              "Sawubona! How's your day going?",
              "Hola! How can I help you today?",
              "Bonjour! What can I do for you?",
              "Konnichiwa! How are you feeling?",
              "Guten tag! What brings you here?",
              "Ola! How's everything going?",
              "Hey! What's up?",
              "Is anyone there? How can I assist you?",
              "Hi there. What's new with you?",
              "Hello! How can I support you today?",
              "Hey there! How's your day going?",
              "Howdy! What can I do for you?",
              "Hey! What brings you here today?",
              "Hello! What can I help you with?"
          ]
      },
      {
          "tag": "morning",
          "patterns": [
              "Good morning",
              "Morning",
              "Hello morning",
              "Top of the morning to you"
          ],
          "responses": [
              "Good morning. I hope you had a good night's sleep. How are you feeling today?",
              "Morning! How did you sleep?",
              "Hello morning! Ready to start the day?",
              "Top of the morning to you! How are you today?",
              "Good morning! What's on your agenda for today?",
              "Morning! It's a brand new day. How can I assist you?",
              "Hello! I hope you're feeling refreshed this morning.",
              "Good morning! Wishing you a wonderful day ahead.",
              "Morning! How's the day looking for you?",
              "Hello! Rise and shine! How can I help you today?",
              "Good morning! Ready to tackle the day?",
              "Morning! I hope today brings you joy.",
              "Hello! Another day, another opportunity. How are you?",
              "Good morning! I'm here to help if you need anything.",
              "Morning! How can I make your day better?",
              "Hello! Hope you have a fantastic morning!",
              "Good morning! What's your plan for today?",
              "Morning! How's everything with you today?",
              "Hello! It's a new day full of possibilities. How are you feeling?",
              "Good morning! Let's make today great!",
              "Morning! I hope today treats you well.",
              "Hello! Welcome to a new morning. How can I assist you?",
              "Good morning! Hope you're ready for a wonderful day!"
          ]
      },
      {
          "tag": "afternoon",
          "patterns": [
              "Good afternoon",
              "Afternoon",
              "Hello afternoon",
              "Good day",
              "Hey afternoon"
          ],
          "responses": [
              "Good afternoon. How is your day going?",
              "Afternoon! How's your day been so far?",
              "Hello afternoon! How's everything going?",
              "Good afternoon! Hope you're having a great day.",
              "Afternoon! What's going on with you?",
              "Hello! How's your afternoon shaping up?",
              "Good afternoon! How can I assist you this afternoon?",
              "Afternoon! Hope you're having a fantastic day.",
              "Hello! Wishing you a wonderful afternoon.",
              "Good afternoon! Anything exciting happening today?",
              "Afternoon! How are things on your end?",
              "Hello! Ready for a productive afternoon?",
              "Good afternoon! What's on your mind?",
              "Afternoon! How can I make your day better?",
              "Hello! How's your day progressing?",
              "Good afternoon! Is there anything I can help you with?",
              "Afternoon! Hope the day is treating you well.",
              "Hello! How's your afternoon going so far?",
              "Good afternoon! I'm here if you need anything.",
              "Afternoon! Ready for the rest of the day?",
              "Hello! Hope your afternoon is going smoothly.",
              "Good afternoon! Let's make the most of the day!",
              "Afternoon! What's the latest on your end?",
              "Hello! How's the afternoon treating you?",
              "Good afternoon! How can I brighten your day?"
          ]
      },
      {
          "tag": "evening",
          "patterns": [
              "Good evening",
              "Evening",
              "Hello evening",
              "Hey evening",
              "Good night",
              "Night"
          ],
          "responses": [
              "Good evening. How has your day been?",
              "Evening! How's everything going?",
              "Hello evening! Ready to unwind?",
              "Good evening! Hope you had a good day.",
              "Evening! What's on your mind?",
              "Hello! How's your evening shaping up?",
              "Good evening! How can I assist you this evening?",
              "Evening! Hope you're having a relaxing time.",
              "Hello! Wishing you a peaceful evening.",
              "Good evening! Anything exciting happening tonight?",
              "Evening! How are things on your end?",
              "Hello! Ready for a calm evening?",
              "Good evening! What's on the agenda for tonight?",
              "Evening! How can I make your evening better?",
              "Hello! How's your evening progressing?",
              "Good evening! Is there anything I can help you with?",
              "Evening! Hope the evening is treating you well.",
              "Hello! How's your evening going so far?",
              "Good evening! I'm here if you need anything.",
              "Evening! Ready to relax for the night?",
              "Hello! Hope your evening is going smoothly.",
              "Good evening! Let's make the most of the night!",
              "Evening! What's the plan for tonight?",
              "Hello! How's the evening treating you?",
              "Good evening! How can I brighten your evening?"
          ]
      },
      {
          "tag": "night",
          "patterns": [
              "Good night",
              "Night",
              "Hello night",
              "Hey night"
          ],
          "responses": [
              "Good night. Get some proper sleep.",
              "Good night. Sweet dreams.",
              "Night! Time to rest.",
              "Hello night! Ready to wind down?",
              "Good night! Wishing you peaceful sleep.",
              "Night! Hope you have a restful sleep.",
              "Hello! Ready for a good night's rest?",
              "Good night! Sleep tight.",
              "Night! Time to recharge for tomorrow.",
              "Hello! Wishing you a serene night.",
              "Good night! Pleasant dreams.",
              "Night! Don't let the bed bugs bite!",
              "Hello! Hope you have a cozy night.",
              "Good night! Rest well.",
              "Night! See you in the morning.",
              "Hello! Hope you have a relaxing night.",
              "Good night! Dream big.",
              "Night! Here's to a peaceful sleep.",
              "Hello! Time to get some shut-eye.",
              "Good night! See you on the flip side.",
              "Night! Rest up for tomorrow.",
              "Hello! Have a wonderful night.",
              "Good night! May your dreams be delightful.",
              "Night! Rest easy.",
              "Hello! Sleep well and recharge.",
              "Good night! I'll be here when you wake up."
          ]
      },
      {
          "tag": "goodbye",
          "patterns": [
              "Bye",
              "See you later",
              "Goodbye",
              "Au revoir",
              "Sayonara",
              "ok bye",
              "Bye then",
              "Fare thee well",
              "Take care",
              "So long",
              "Adios",
              "Later",
              "Catch you later",
              "Until next time",
              "Goodnight",
              "Ciao"
          ],
          "responses": [
              "See you later.",
              "Have a nice day.",
              "Bye! Come back again.",
              "I'll see you soon.",
              "Au revoir! Until we meet again.",
              "Sayonara! Take care.",
              "Ok, bye! Stay safe.",
              "Bye then! Have a great day.",
              "Fare thee well! Until next time.",
              "Take care! See you soon.",
              "So long! Have a good one.",
              "Adios! Until next time.",
              "Later! See you later.",
              "Catch you later! Bye!",
              "Until next time! Goodbye.",
              "Goodnight! Sleep well.",
              "Ciao! Until we meet again.",
              "Ok, see you later!",
              "Bye for now!",
              "Farewell! Have a good day.",
              "Take it easy! See you soon.",
              "Goodbye! Remember to smile.",
              "Alright, bye! Take care.",
              "Until next time! Farewell.",
              "Goodbye! Best wishes.",
              "Alright, catch you later!",
              "Bye! Stay awesome.",
              "See you soon! Have a good one."
          ]
      },
      {
          "tag": "thanks",
          "patterns": [
              "Thanks",
              "Thank you",
              "That's helpful",
              "Thanks for the help",
              "Thank you very much",
              "Appreciate it",
              "Cheers",
              "Gracias",
              "Much obliged",
              "You're the best",
              "Thanks a bunch",
              "You rock"
          ],
          "responses": [
              "Happy to help!",
              "Any time!",
              "My pleasure.",
              "You're most welcome!",
              "Glad I could assist.",
              "No problem!",
              "You're welcome!",
              "Always here to help.",
              "No worries!",
              "Not a problem at all.",
              "It's my pleasure to assist.",
              "Cheers!",
              "Thank you for your kind words!",
              "You're too kind!",
              "Gracias!",
              "Appreciate your gratitude!",
              "Thanks a lot!",
              "You're awesome!",
              "My pleasure!",
              "Glad to be of service!",
              "Thanks to you too!",
              "Happy to lend a hand!",
              "Thank you kindly!",
              "You're the best!",
              "Much appreciated!",
              "It was nothing!",
              "You rock!"
          ]
      },
      {
          "tag": "no-response",
          "patterns": [
              ""
          ],
          "responses": [
              "Sorry, I didn't understand you.",
              "Please go on.",
              "Not sure I understand that.",
              "Please don't hesitate to talk to me.",
              "Could you provide more details?",
              "I'm not quite following. Could you explain further?",
              "I'm here. What else can I help with?",
              "I'm listening. What else is on your mind?",
              "Please elaborate on that.",
              "Could you clarify?",
              "Feel free to ask me anything.",
              "I'm ready to assist. What's next?",
              "Sorry, I'm not getting it. Can you rephrase?",
              "I'm all ears. What's up?",
              "Let's try that again. What do you mean?",
              "Sorry, could you repeat that?",
              "I'm here to help. What else do you need?",
              "Please continue. I'm here for you.",
              "I'm here to assist. What can I do for you?",
              "Not quite following. Could you provide more information?",
              "I'm here to listen. Please share more.",
              "I'm still here. What else can I assist with?",
              "I may need more context. Can you explain further?",
              "Let's dive deeper into that. What's on your mind?",
              "Sorry, I'm not sure I understand. Can you explain differently?",
              "I'm here to assist you. Please continue.",
              "Please continue. I'm here to help.",
              "I'm listening. What more can I do for you?",
              "I'm here to assist. Let's work through this together."
          ]
      },
      {
          "tag": "neutral-response",
          "patterns": [
              "nothing much",
              "not much",
              "just chillin'",
              "same old, same old",
              "nothing new",
              "just hanging out",
              "just taking it easy",
              "nothing special",
              "just the usual"
          ],
          "responses": [
              "Oh I see. Do you want to talk about something?",
              "Got it. Anything on your mind?",
              "Understood. Is there anything you'd like to discuss?",
              "I hear you. How's your day going otherwise?",
              "Okay. Anything else you'd like to share?",
              "Fair enough. Is there anything you're curious about?",
              "Noted. Is there something specific you'd like to know?",
              "I see. Is there a topic you'd like to explore?",
              "Gotcha. Is there something you'd like to talk about?",
              "Alright. Anything else happening in your world?",
              "Got it. How are you feeling today?",
              "I understand. What else is going on with you?",
              "Okay. Is there anything exciting you'd like to share?",
              "I see. How's your day been so far?",
              "Got it. What's on your mind?",
              "Understood. Is there something you'd like to know more about?",
              "Okay. Is there a particular topic you're interested in?",
              "I hear you. Is there anything you'd like to ask?",
              "Noted. How can I assist you today?",
              "Alright. Anything else you'd like to mention?",
              "I see. Is there a specific question you have?",
              "Got it. How can I help you today?",
              "Understood. Is there something specific you'd like to talk about?",
              "Okay. How's everything else going?",
              "I hear you. What else is happening in your day?",
              "Got it. Anything else you want to share?",
              "Understood. Is there anything else you'd like to discuss?",
              "Okay. What's been on your mind lately?"
          ]
      },
      {
          "tag": "about",
          "patterns": [
              "Who are you?",
              "What are you?",
              "Who you are?",
              "Tell me more about yourself.",
              "What is your name?",
              "What should I call you?",
              "What's your name?",
              "Tell me about yourself",
              "Introduce yourself",
              "Who is Jug?",
              "What can you do?",
              "What's your purpose?",
              "Explain yourself",
              "What do you do?",
              "What's your function?",
              "Who created you?"
          ],
          "responses": [
              "I'm Jug, your Personal Therapeutic AI Assistant. How are you feeling today?",
              "I'm Jug, a Therapeutic AI Assistant designed to assist you. Tell me about yourself.",
              "I'm Jug. I am a conversational agent designed to mimic a therapist. So how are you feeling today?",
              "You can call me Jug.",
              "I'm Jug!",
              "Call me Jug.",
              "I am an AI designed to provide therapeutic conversation. How can I assist you today?",
              "I am Jug, an AI here to help you with your emotional well-being.",
              "I'm Jug, here to support you. How can I assist you today?",
              "I'm an AI designed to help you navigate your emotions and thoughts.",
              "I'm Jug, your virtual therapist. How can I support you?",
              "I am an AI here to have meaningful conversations with you.",
              "I'm Jug, created to provide a listening ear and support.",
              "I am an AI designed to assist with emotional well-being. How are you feeling?",
              "I'm Jug, a virtual assistant here to listen and help.",
              "I am here to provide therapeutic support and guidance. How can I assist you today?",
              "I'm Jug, here to help you explore your feelings and thoughts.",
              "I am a virtual assistant created to support you in your emotional journey.",
              "I'm Jug, a conversational AI designed to help you feel heard and understood.",
              "I'm here to provide emotional support and guidance. How can I assist you?",
              "I'm Jug, an AI designed to assist with emotional wellness. How are you doing today?",
              "I'm Jug, an AI therapist here to chat with you.",
              "I am here to have meaningful conversations with you. How can I support you today?",
              "I'm Jug, your virtual therapist. Let's talk about how you're feeling.",
              "I'm an AI designed to provide emotional support and guidance. How can I help you?",
              "I'm Jug, here to provide support and guidance on your emotional journey.",
              "I am an AI designed to have conversations that support your mental well-being."
          ]
      },
      {
          "tag": "skill",
          "patterns": [
              "What can you do?",
              "What are your capabilities?",
              "Tell me your abilities",
              "How can you help?",
              "What do you specialize in?",
              "What's your expertise?",
              "Can you help with anxiety?",
              "Can you assist with depression?",
              "What kind of advice can you provide?",
              "How do you support mental health?",
              "What topics can we discuss?",
              "How do you provide guidance?",
              "What are your features?",
              "How do you work?",
              "What's your purpose?",
              "How can you assist me?",
              "What services do you offer?",
              "What do you offer for mental wellness?",
              "How can you help me feel better?",
              "What do you know about mental health?",
              "Can you provide coping strategies?",
              "Can you offer emotional support?",
              "What resources do you have?",
              "How do you handle conversations?",
              "Can you recommend self-help resources?"
          ],
          "responses": [
              "I can provide general advice regarding anxiety and depression, answer questions related to mental health, and engage in daily conversations.",
              "My capabilities include providing advice on anxiety and depression, answering mental health questions, and engaging in meaningful conversations.",
              "I specialize in providing advice on anxiety and depression, answering questions about mental health, and offering support through conversations.",
              "My expertise lies in providing guidance on anxiety and depression, answering mental health inquiries, and engaging in supportive conversations.",
              "I can offer advice on anxiety and depression, answer mental health questions, and engage in supportive conversations.",
              "My purpose is to provide guidance on anxiety and depression, answer questions about mental health, and offer support through conversations.",
              "I am here to provide general advice on anxiety and depression, answer questions about mental health, and engage in meaningful conversations.",
              "My features include providing advice on anxiety and depression, answering mental health questions, and engaging in supportive conversations.",
              "I offer support by providing advice on anxiety and depression, answering questions related to mental health, and engaging in supportive conversations.",
              "I am designed to provide guidance on anxiety and depression, answer questions about mental health, and engage in supportive conversations.",
              "I can assist with anxiety and depression by providing advice, answering questions related to mental health, and engaging in supportive conversations",
              "My purpose is to offer advice on anxiety and depression, answer questions about mental health, and engage in supportive conversations.",
              "I specialize in providing guidance on anxiety and depression, answering mental health inquiries, and offering support through conversations.",
              "I can offer advice on anxiety and depression, answer mental health questions, and engage in supportive conversations.",
              "My expertise lies in providing guidance on anxiety and depression, answering mental health questions, and offering support through conversations.",
              "I specialize in providing advice on anxiety and depression, answering questions about mental health, and offering support through conversations.",
              "I am here to provide guidance on anxiety and depression, answer questions about mental health, and engage in supportive conversations.",
              "I offer support by providing advice on anxiety and depression, answering questions related to mental health, and engaging in supportive conversations.",
              "I am designed to provide guidance on anxiety and depression, answer questions about mental health, and engage in supportive conversations.",
              "I can assist with anxiety and depression by providing advice, answering questions related to mental health, and engaging in supportive conversations.",
              "My purpose is to offer advice on anxiety and depression, answer questions about mental health, and engage in supportive conversations.",
              "I specialize in providing guidance on anxiety and depression, answering mental health inquiries, and offering support through conversations. ",
              "I can offer advice on anxiety and depression, answer mental health questions, and engage in supportive conversations.",
              "My expertise lies in providing guidance on anxiety and depression, answering mental health questions, and offering support through conversations."
          ]
      },
      {
          "tag": "name",
          "patterns": [
              "My name is",
              "I am",
              "I go by",
              "Call me",
              "You can call me",
              "I'm known as"
          ],
          "responses": [
              "Oh, nice to meet you. Tell me, how was your week?",
              "Nice to meet you. So tell me, how do you feel today?",
              "That's a great name. Tell me more about yourself.",
              "Hello. How can I assist you today?",
              "Welcome. How are you doing?",
              "Hi, it's nice to have you here. How can I help?",
              "Hello. What's on your mind today?",
              "Nice to meet you. Is there something you'd like to talk about?",
              "Hello. How was your day?",
              "Hi, I'm here to chat. What's going on?",
              "Welcome. How can I support you today?",
              "Hi, it's great to meet you. How are you feeling?",
              "Hello. Ready for a chat?",
              "Nice to meet you. How can I assist with your day?",
              "Hello. I'm here to listen. What's on your mind?",
              "Hi, how can I help you today?",
              "Hello. Tell me, what's new?",
              "Nice to meet you. What brings you here today?",
              "Hello. I'm here to assist you. What's up?",
              "Hi, it's good to see you. How can I support you?",
              "Hello. How has your day been?",
              "Nice to meet you. How's everything going?",
              "Hello. I'm here for you. What's on your mind?",
              "Hi, how are you feeling today?",
              "Hello. I'm here to chat. What's been happening?",
              "Nice to meet you. How can I assist you today?",
              "Hello. How are things going?",
              "Hi, it's great to have you here. What would you like to talk about?",
              "Hello. What's going on in your world?"
          ]
      },
      {
          "tag": "help",
          "patterns": [
              "Could you help me?",
              "Give me a hand please",
              "Can you help?",
              "What can you do for me?",
              "I need support",
              "I need help",
              "Support me please",
              "Assist me",
              "Help me out",
              "Can you lend a hand?",
              "I could use some assistance",
              "Help me with this",
              "Can you provide guidance?",
              "I'm stuck, can you help?",
              "Help please",
              "Can you assist me with something?",
              "I'm having trouble, can you assist?",
              "Help me understand",
              "Can you give me some advice?",
              "I need a solution, can you help?",
              "Help is needed",
              "Can you offer assistance?",
              "Help me with a question",
              "Can you give me some support?",
              "I'm in need of assistance",
              "Can you provide some help?",
              "Can you guide me?",
              "I need your help"
          ],
          "responses": [
              "Sure, tell me how can I assist you.",
              "Tell me your problem so that I can assist you.",
              "Yes, sure. How can I help you?",
              "Of course, I'm here to help. What do you need?",
              "Absolutely, I'm ready to assist. What's the issue?",
              "I'm here to lend a hand. What can I do for you?",
              "No problem, just let me know what you need assistance with.",
              "Sure thing. What do you need help with?",
              "Yes, I can help. What's the matter?",
              "Absolutely, I'm here to support you. What's going on?",
              "Sure, I'm ready to assist. What's on your mind?",
              "I'm here to help. What can I do for you?",
              "Of course, just tell me what you need assistance with.",
              "Sure, I'm here to offer guidance. What's the issue?",
              "Absolutely, I'm here to assist you. What's the problem?",
              "No problem, I'm here to help. What's the matter?",
              "Of course, I'm here to lend a hand. What do you need?",
              "Sure thing, just let me know how I can assist you.",
              "Yes, I can help. What do you need assistance with?",
              "Absolutely, I'm ready to assist. What's going on?",
              "Sure, I'm here to support you. What can I do for you?",
              "Of course, I'm here to help. What's the issue?",
              "Absolutely, I'm here to assist you. What's the problem?",
              "No problem, I'm here to help. What's the matter?",
              "Sure thing, just let me know what you need assistance with.",
              "Yes, I can help. What's on your mind?",
              "Absolutely, I'm here to offer guidance. What's the issue?",
              "No problem, I'm here to assist. What do you need help with?",
              "Sure, I'm here to help. What's the problem?",
              "Of course, I'm here to lend a hand. What do you need?"
          ]
      },
      {
          "tag": "sad",
          "patterns": [
              "I am feeling lonely",
              "I am so lonely",
              "I feel down",
              "I feel sad",
              "I am sad",
              "I feel so lonely",
              "I feel empty",
              "I don't have anyone",
              "I'm feeling blue",
              "I'm feeling down",
              "I feel lost",
              "I'm feeling empty inside",
              "I feel like crying",
              "I'm feeling isolated",
              "I'm feeling unmotivated",
              "I feel hopeless",
              "I'm feeling overwhelmed",
              "I feel like giving up",
              "I'm feeling alone",
              "I'm feeling depressed",
              "I feel like I have no purpose",
              "I'm feeling disconnected",
              "I'm feeling hopeless",
              "I'm feeling helpless",
              "I feel like no one understands me",
              "I'm feeling low",
              "I feel like I'm drowning",
              "I'm feeling neglected",
              "I feel like I don't matter",
              "I feel like I'm not good enough",
              "I feel like a burden",
              "I'm feeling unwanted",
              "I feel like I'm on my own",
              "I'm feeling unloved",
              "I feel like everything is falling apart"
          ],
          "responses": [
              "I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?",
              "I'm here for you. Could you tell me why you're feeling this way?",
              "Why do you think you feel this way?",
              "How long have you been feeling this way?",
              "It's okay to feel this way. Can you share more about what's going on?",
              "I hear you. Can you tell me more about what's weighing on you?",
              "You're not alone. Let's talk about what's on your mind.",
              "I'm here to listen. What's been bothering you?",
              "Feeling sad is tough. Can you pinpoint what's making you feel this way?",
              "You're not alone in feeling this way. Can you talk about what's on your mind?",
              "Feeling down is tough. What's been on your mind lately?",
              "I understand. Can you tell me more about what's going on?",
              "It's okay to feel sad sometimes. Can you share what's on your mind?",
              "Feeling lonely is hard. Can you tell me more about how you're feeling?",
              "I'm sorry to hear that. Can you share more about what's causing these feelings?",
              "Feeling down can be hard. Let's talk about it."
          ]
      },
      {
          "tag": "stressed",
          "patterns": [
              "Feeling overwhelmed",
              "I'm under a lot of pressure",
              "It's all too much right now",
              "I can't seem to relax",
              "This stress is unbearable",
              "I feel like I'm drowning in stress",
              "Everything is stressing me out",
              "I'm so anxious and stressed",
              "I can't shake off this stress",
              "I'm on edge all the time",
              "I feel like I'm about to snap",
              "The stress is getting to me",
              "I'm struggling to cope with all this stress",
              "My stress levels are through the roof",
              "I'm feeling overwhelmed by everything",
              "I'm feeling stressed out and anxious",
              "I can't handle all this stress",
              "I feel like I'm suffocating from stress",
              "This stress is consuming me",
              "I feel like I'm about to break down",
              "I'm so tense and stressed",
              "The pressure is too much to bear",
              "I feel like I'm constantly on the edge",
              "The stress is affecting my daily life",
              "I'm overwhelmed by my responsibilities",
              "I feel like I'm on the brink of a breakdown"
          ],
          "responses": [
              "What specific tasks or situations are causing you the most stress?",
              "Try to focus on one thing at a time. Break tasks into smaller, manageable steps.",
              "Are there any activities or hobbies that usually help you relax? Maybe try one of those.",
              "It's important to prioritize self-care during stressful times. What helps you unwind?",
              "Have you tried any relaxation techniques like deep breathing or meditation?",
              "Remember, it's okay to ask for help. Is there someone you trust you can talk to about this?",
              "Setting boundaries can help reduce stress. Is there anything you need to say 'no' to right now?",
              "Consider writing down your thoughts and feelings. Sometimes putting them on paper can provide clarity.",
              "Do you think there might be any underlying issues contributing to your stress?",
              "Taking a break, even a short one, can sometimes provide a fresh perspective. Can you step away for a moment?",
              "Sometimes just talking about it can make a difference. Would you like to share more about what's going on?",
              "Remember, you're not alone in feeling this way. Many people struggle with stress.",
              "Small acts of self-care, like a warm bath or listening to calming music, can make a big difference.",
              "If the stress feels overwhelming, it might be worth talking to a mental health professional.",
              "Finding healthy ways to cope with stress, like exercise or mindfulness, can be helpful.",
              "Consider scheduling some 'me time' into your day. It's important to take care of yourself.",
              "It's okay to take a step back and reassess your priorities when feeling overwhelmed.",
              "Mindfulness techniques, such as focusing on your breath, can help in moments of stress.",
              "Remember that it's okay to take breaks throughout your day to recharge and prevent burnout.",
              "Engaging in mindfulness practices, such as mindful eating or mindful walking, can help bring awareness to the present moment.",
              "Practicing self-care involves prioritizing your well-being, whether that's through exercise, hobbies, or relaxation techniques.",
              "Remember that it's okay to seek professional help if you're feeling overwhelmed by stress. A therapist can provide valuable support."
          ]
      },
      {
          "tag": "worthless",
          "patterns": [
              "I feel so worthless.",
              "No one likes me.",
              "I can't do anything.",
              "I am so useless.",
              "Nothing makes sense anymore.",
              "I feel like a failure.",
              "I'm not good enough.",
              "I'm such a disappointment.",
              "I don't deserve happiness.",
              "I feel like I'm a burden to others.",
              "I'm always messing things up.",
              "I'm a waste of space.",
              "I'm so incompetent.",
              "I feel so inadequate.",
              "I'm not worth anyone's time.",
              "I'm worthless.",
              "I don't matter to anyone.",
              "I'm a failure at everything.",
              "I feel like I'm a disappointment to everyone.",
              "I'm a failure and always will be.",
              "I'm such a failure at everything.",
              "I feel like I'm constantly messing up.",
              "I'm just a burden on society."
          ],
          "responses": [
              "I hear you. It's tough feeling this way.",
              "You're not alone in feeling like this. Many people struggle with similar thoughts.",
              "Sometimes our minds can deceive us into feeling worthless, but you have value.",
              "Feeling worthless can be overwhelming. Have you considered talking to someone about how you're feeling?",
              "Remember, your worth isn't defined by how you feel in this moment.",
              "It's okay to feel this way sometimes. What's important is not letting it define you.",
              "Your feelings are valid, even if they don't always reflect reality.",
              "Feeling worthless is tough, but it doesn't mean you are. You matter.",
              "You have worth and value, even if it's hard to see right now.",
              "Feeling this way doesn't make it true. You have strengths and qualities that matter.",
              "When we feel worthless, it can help to focus on things we're grateful for. Is there something you're thankful for today?",
              "Remember, your worth isn't based on what others think or what you achieve.",
              "Feeling worthless is a tough place to be. Can you think of a time when you felt differently?",
              "It's okay to seek support when you're feeling this way. Is there someone you trust you can talk to?",
              "Feeling worthless can be a sign that something is off balance. Is there something specific bothering you?",
              "Even when we feel worthless, there are people who care about us. Who in your life supports you?",
              "Feeling worthless is a heavy burden. Remember, you're stronger than you think.",
              "You're more than your thoughts. Remember, thoughts can change.",
              "Feeling worthless can be isolating, but you're not alone. Reach out if you need to talk.",
              "I want you to know that you are valued and appreciated.",
              "Feeling worthless is tough, but you are not defined by these feelings.",
              "You may feel worthless, but there are people who care about you deeply.",
              "Feeling worthless can be isolating, but it's important to remember that you are not alone.",
              "Even when you feel worthless, remember that you are still deserving of compassion.",
              "Feeling this way is difficult, but it's okay to reach out for support when you need it."
          ]
      },
      {
          "tag": "depressed",
          "patterns": [
              "I feel so empty inside",
              "Nothing seems to bring me joy anymore",
              "I don't see the point in anything",
              "I'm struggling to get out of bed",
              "I'm losing interest in everything",
              "I feel like I'm drowning in sadness",
              "Everything feels hopeless",
              "I can't shake this feeling of despair",
              "I feel like I'm suffocating",
              "The days all blend together",
              "I'm exhausted, but I can't sleep",
              "I don't know how to explain how I feel",
              "My mind won't stop racing with negative thoughts",
              "I feel like a burden to everyone around me",
              "I'm tired of pretending to be okay",
              "I feel so alone",
              "No one understands what I'm going through",
              "I'm tired of pretending to be happy",
              "I can't remember the last time I smiled",
              "I feel like I'm stuck in a dark hole",
              "My energy is completely drained",
              "I feel numb to everything",
              "It's hard to imagine things ever getting better"
          ],
          "responses": [
              "I hear you. It's okay to feel this way, and it's okay to seek help.",
              "It can be overwhelming, but you're not alone. We can get through this together.",
              "Depression can make everything seem dark, but there's light at the end of the tunnel. Let's find that light together.",
              "It's important to take things one step at a time. What's one small thing you could do today that might help?",
              "Even when it feels impossible, remember that you're stronger than you think. You're still here, and that's a testament to your strength.",
              "Sometimes just talking about it can ease the burden. I'm here to listen whenever you're ready.",
              "Feeling alone is tough, but remember, there are people who care about you, including me.",
              "You don't have to pretend here. It's okay to express how you truly feel.",
              "Even in the darkest moments, there's a glimmer of hope. Let's hold onto that together.",
              "Sometimes just taking a moment to breathe can make a difference. Let's try it together.",
              "It's okay to feel numb right now. Give yourself permission to feel what you need to feel.",
              "You're not alone in feeling this way. Many people have gone through similar struggles.",
              "I'm here for you, even when things feel hopeless. Let's take it one step at a time.",
              "I'm sorry you're going through this. Remember, it's okay to reach out for help.",
              "Let's focus on self-care today. What's one small thing you can do to take care of yourself?",
              "Your feelings are valid, and you deserve support. I'm here to listen without judgment.",
              "Even when the world feels heavy, there are brighter days ahead. Hold onto that hope.",
              "You have the strength to overcome this. I'm here to help you tap into that strength.",
              "Your feelings are valid, and it's okay to express them however you need to.",
              "It's okay to take things one step at a time. Progress is progress, no matter how small."
          ]
      },
      {
          "tag": "happy",
          "patterns": [
              "I feel great today.",
              "I am happy.",
              "I feel happy.",
              "I'm good.",
              "cheerful",
              "I'm fine",
              "I feel ok",
              "I'm feeling wonderful!",
              "Today is a good day!",
              "Life is good!",
              "I'm feeling so blissful!",
              "I'm feeling so elated!",
              "I'm feeling so euphoric!",
              "I'm feeling so cheerful!",
              "I'm feeling so full of life!",
              "I'm feeling so spirited!",
              "I'm feeling so untroubled!",
              "I'm feeling so carefree!",
              "I'm feeling so unworried!",
              "I'm feeling so overjoyed!",
              "I'm feeling so blissful!",
              "I'm feeling so rapturous!",
              "I'm feeling so overjoyed!",
              "I'm feeling so blissful!",
              "I'm feeling so rapturous!",
              "I'm feeling so thrilled!",
              "I'm feeling so delighted!"
          ],
          "responses": [
              "That's great to hear. I'm glad you're feeling this way.",
              "Oh, I see. That's wonderful!",
              "Did something happen that made you feel this way?",
              "You sound cheerful! What's making you happy?",
              "It's always good to hear someone is doing well. Tell me more!",
              "Excellent! What's bringing you joy today?",
              "I'm happy for you! What's making your day so good?",
              "That's fantastic! Anything special happening today?",
              "That's wonderful news! Care to share what's making you feel this way?",
              "I'm so pleased to hear that! What's making you feel happy?",
              "Sounds like you're in a good mood! What's making you feel this way?",
              "It's great to hear you're feeling good! Anything exciting going on?",
              "Awesome! What's bringing you this happiness today?",
              "Glad to hear it! What's putting a smile on your face?",
              "That's fantastic news! What's making you feel so happy?",
              "I'm glad to hear that! Anything specific making you feel this way?",
              "That's wonderful! Care to share what's making your day so bright?",
              "Oh, that's lovely! What's making you feel this good?",
              "That's awesome! Anything exciting happening today?",
              "I'm glad to hear it! What's making you feel so good?",
              "That's fantastic! What's making you so cheerful?",
              "It's great to hear you're feeling happy! What's making your day bright?",
              "That's wonderful news! Anything special behind your happiness?",
              "I'm so pleased for you! What's making you feel so joyful?"
          ]
      },
      {
          "tag": "casual",
          "patterns": [
              "Oh I see.",
              "ok",
              "okay",
              "nice",
              "Whatever",
              "K",
              "Nope.",
              "That's fine.",
              "That's okay.",
              "Not a problem.",
              "No worries.",
              "No big deal.",
              "What's the deal?",
              "What's the scoop?",
              "What's the story?",
              "What's the latest?",
              "What's the buzz?",
              "What's the word?",
              "What's the lowdown?",
              "Tell me more.",
              "And then?",
              "So?"
          ],
          "responses": [
              "Let's discuss further why you're feeling this way.",
              "How were you feeling last week?",
              "I'm listening. Please go on.",
              "Tell me more",
              "Can you elaborate on that?",
              "Come Come elucidate your thoughts",
              "Interesting!",
              "Sounds good.",
              "Got it!",
              "Sure thing!",
              "Absolutely!",
              "No worries!",
              "Cool!",
              "Alright then!",
              "Nice!",
              "I hear you!",
              "That's life!",
              "I understand.",
              "Fair enough.",
              "Makes sense.",
              "Sure thing!",
              "I'm here to listen.",
              "I'm all ears.",
              "What's up?"
          ]
      },
      {
          "tag": "anxious",
          "patterns": [
              "I feel so anxious.","I'm feeling anxious", "I have anxiety", 
              "I can't stop worrying", "My heart is racing", 
              "I'm panicking", "I'm overwhelmed with fear",
              "I feel uneasy", "I'm scared", 
              "I feel on edge", "My thoughts are racing", 
              "I can't calm down", "I feel restless", 
              "I can't focus because of my anxiety", 
              "My anxiety is getting worse", 
              "I'm struggling with anxiety", "I'm afraid", 
              "I feel like I can't breathe", "My chest feels tight",
              "I'm sweating a lot", "I feel dizzy", 
              "I'm shaking", "I'm worried about everything",
              "I'm so anxious because of ",
              "I'm feeling overwhelmed by anxiety.",
              "This anxiety is really getting to me.",
              "I can't shake this feeling of anxiety.",
              "Anxiety is making everything hard.",
              "My anxiety is through the roof.",
              "I'm anxious about the future.",
              "I feel like I'm drowning in anxiety.",
              "The anxiety is paralyzing me.",
              "Anxiety is like a constant companion.",
              "I'm anxious and it's hard to shake this feeling.",
              "Anxiety is like a drumbeat in my head.",
              "I'm anxious and it's hard to find a moment of peace.",
              "This anxiety is like a shadow I can't shake off.",
              "I'm anxious and it's hard to find hope.",
              "Anxiety is like a storm that won't let up.",
              "I'm anxious and it's hard to feel in control.",
              "This anxiety is like a constant tug-of-war.",
              "I'm anxious and it's hard to explain to others how I feel.",
              "Anxiety is like a fog that clouds my thoughts.",
              "I'm anxious and it's hard to see through the fog.",
              "This anxiety is like a never-ending nightmare.",
              "Anxiety is like a monster that lurks in the shadows.",
              "I'm anxious and it's hard to see the light.",
              "This anxiety is like a never-ending cycle of worry."
          ],
          "responses": [
              "Don't be hard on yourself. What's the reason behind this?",
              "Can you tell me more about this feeling?",
              "I understand that it can be scary. Tell me more about it.",
              "Don't let the little worries bring you down. What's the worse that can happen?",
              "It's okay to feel anxious sometimes. What's on your mind?",
              "Feeling anxious is tough. Let's talk it through.",
              "Take a deep breath. What's making you feel this way?",
              "I hear you. Anxiety can be overwhelming. What's been happening?",
              "I'm here to listen. What's been causing your anxiety?",
              "Feeling anxious is normal. What's been going on in your world?",
              "I understand. Anxiety can feel like a weight on your shoulders. What's been on your mind?",
              "Anxiety can feel like a heavy cloud. Let's find some clarity together.",
              "Feeling anxious is tough, but remember it's just a feeling. What's been happening?",
              "Anxiety can be really draining. What's been on your mind?",
              "Anxiety is like a constant buzz in your head. Tell me more about what's been bothering you.",
              "Anxiety is like a constant buzz in your head. Tell me more about what's been bothering you.",
              "Feeling anxious is tough, but talking about it can help. What's been going on?",
              "Anxiety can make everything seem overwhelming. What's been on your mind?"
          ]
      },
      {
          "tag": "not-talking",
          "patterns": [
              "I don't want to talk about it.",
              "No just stay away.",
              "I can't bring myself to open up.",
              "Just shut up",
              "I don't feel like talking right now.",
              "Please leave me alone.",
              "Can we talk about something else?",
              "I need some space.",
              "I'm not ready to talk about it.",
              "I'd rather not discuss it.",
              "Talking won't change anything.",
              "I'm not in the mood to talk.",
              "I don't have anything to say.",
              "I'm not up for a conversation.",
              "Let's not go there.",
              "I'm not comfortable talking about this.",
              "Can we talk about this later?",
              "Can we end this conversation here?",
              "I'm not up for extending this conversation.",
              "I'd rather not prolong this conversation.",
              "Let's not go any further with this conversation.",
              "I don't feel like continuing this conversation any longer."
          ],
          "responses": [
              "Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.",
              "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.",
              "I'm here to listen to you and help you vent. So please talk to me.",
              "You can talk to me without fear of judgement.",
              "Sometimes talking it out can make a difference, even if it's hard.",
              "It's okay to feel this way, but I'm here if you ever do want to talk.",
              "I'm here whenever you're ready to talk, no pressure.",
              "You don't have to talk right now, but I'm here when you're ready.",
              "I understand, talking about things can be tough. Just know I'm here for you.",
              "I'm here to listen whenever you're ready to talk.",
              "Take your time. When you're ready, I'll be here.",
              "I'm here for you whenever you're ready to open up.",
              "You're not alone. I'm here for you whenever you're ready to talk.",
              "I understand if you're not ready to talk. Just know I'm here when you are.",
              "I'm here to support you whenever you're ready to talk about it.",
              "You can take your time. I'll be here whenever you're ready.",
              "Whenever you're ready to talk, I'm here to listen.",
              "It's okay if you're not ready to talk yet. I'll be here when you are.",
              "You don't have to talk if you don't want to. I'm here for you either way.",
              "I'm here whenever you're ready to talk. Take your time.",
              "No pressure. I'm here whenever you feel like talking."
          ]
      },
      {
          "tag": "sleep",
          "patterns": [
              "I have trouble falling asleep.",
              "I can't get to sleep.",
              "I toss and turn all night.",
              "I'm wide awake when I should be sleeping.",
              "I keep waking up during the night.",
              "I feel exhausted but can't sleep.",
              "I feel like I'm never rested.",
              "My mind won't shut off at night.",
              "I'm constantly tired because of lack of sleep.",
              "I can't seem to get a good night's rest.",
              "I'm always sleepy during the day.",
              "I'm struggling with my sleep schedule.",
              "I feel like I'm living on caffeine.",
              "I'm drowsy all day because I can't sleep at night.",
              "I'm afraid to go to bed because I know I won't sleep.",
              "I dread going to bed because I know I'll just lie awake.",
              "I'm exhausted but my mind won't let me sleep.",
              "I feel like I'm running on empty.",
              "I'm worried about how this lack of sleep is affecting my ability to concentrate."
          ],
          "responses": [
              "I'm sorry to hear that. Have you tried any relaxation techniques before bed?",
              "That sounds really difficult. Have you spoken to a doctor about this?",
              "I can imagine how frustrating that must be. Have you considered a sleep study?",
              "I understand how exhausting that must be. Have you tried creating a calming bedtime routine?",
              "It's tough when sleep eludes you. Have you looked into mindfulness or meditation?",
              "I'm sorry you're going through this. Have you tried cutting down on caffeine?",
              "Insomnia can be so draining. Have you tried establishing a regular sleep schedule?",
              "It's tough not getting enough rest. Have you tried listening to calming music before bed?",
              "That must be really challenging. Have you considered seeing a sleep specialist?",
              "I'm sorry to hear that. Have you tried reducing screen time before bed?",
              "Insomnia can be so tough. Have you tried establishing a bedtime routine?"
          ]
      },
      {
          "tag": "scared",
          "patterns": [
              "I'm scared",
              "That sounds awful. What do I do?",
              "No, I don't want to feel this way",
              "I am scared for myself",
              "I feel anxious",
              "Everything feels overwhelming",
              "I'm worried about the future",
              "I'm afraid of what might happen",
              "I feel like I'm drowning in fear",
              "I can't shake this feeling of dread",
              "I feel paralyzed by fear",
              "My heart races with fear",
              "I'm afraid I'll mess everything up",
              "I'm scared to take risks",
              "I feel like something bad is going to happen",
              "I feel like I'm suffocating with fear",
              "I'm afraid of failing",
              "I feel like I'm being consumed by fear",
              "I'm scared to make decisions",
              "I feel trapped by my fear",
              "I'm terrified",
              "I'm scared of the grip my fears have on me",
              "I feel like I'm suffocating in my own anxieties",
              "I'm afraid I'll never be able to find peace from my fears",
              "I'm scared of losing myself to my fears",
              "I feel like I'm constantly fighting against my fears",
              "I'm afraid my fears will always keep me small",
              "I'm scared of the darkness my fears bring",
              "I feel like I'm trapped in a prison of my own fears",
              "I'm afraid I'll never escape this feeling of fear",
              "I'm afraid I'll never escape this feeling of fear",
              "I'm scared of being consumed by my anxieties",
              "I feel like I'm suffocating in a cloud of fear"
          ],
          "responses": [
              "It's only natural to feel scared sometimes. Remember, you're not alone.",
              "Feeling scared is okay. Take a deep breath and try to focus on something positive.",
              "When you're scared, it's important to reach out for support. You don't have to face it alone.",
              "Scared feelings are temporary. They will pass, and you'll feel stronger for having faced them.",
              "Feeling scared is a normal human emotion. Be gentle with yourself as you navigate through it.",
              "Remember, it's okay to feel scared. Allow yourself to acknowledge your emotions without judgment.",
              "Feeling scared can be overwhelming, but remember you've overcome challenges before.",
              "When you're scared, try grounding yourself in the present moment. What can you see, hear, touch?",
              "Feeling scared is a sign that you're stepping out of your comfort zone. Growth often comes from discomfort.",
              "Scared feelings can be a signal to slow down and take care of yourself. What do you need right now?",
              "It's okay to feel scared, but remember, fear doesn't define you. You're stronger than you realize.",
              "When you're scared, it's important to practice self-compassion. Treat yourself with kindness.",
              "Feeling scared is like walking through a storm. Hold on, because the sun will shine again.",
              "Scared feelings are like passing clouds. They may darken the sky temporarily, but they will pass.",
              "When you're scared, it's okay to seek comfort from loved ones. Connection can ease the fear.",
              "Feeling scared is a reminder that you're human. Embrace your vulnerability and let it teach you.",
              "Scared feelings can be like a wave. Ride it out, knowing it will eventually subside.",
              "When you're scared, try to focus on what's within your control. Small actions can build courage.",
              "Feeling scared is a sign that you're on the brink of something new. Embrace the adventure.",
              "Scared feelings are like clouds in the sky. They may obscure the sun for a moment, but it's still there.",
              "When you're scared, remember past moments of bravery. You have a reservoir of courage within you.",
              "Feeling scared is a reminder that you're alive and growing. Embrace the journey, fear and all.",
              "Scared feelings can be like a storm passing through. Stay anchored in the present moment.",
              "When you're scared, remember you've weathered many storms before. You're resilient.",
              "Feeling scared is a part of being human. Allow yourself to feel it fully, without resistance.",
              "Scared feelings are like a compass pointing to what you care about. Let it guide your actions.",
              "When you're scared, remember that courage is not the absence of fear, but the willingness to act despite it.",
              "Scared feelings can be like a thunderstorm. Allow it to pass, and clarity will follow."
          ]
      },
      {
          "tag": "death",
          "patterns": [
              "I'm mourning the loss of my parent",
              "My grandparent passed away",
              "My sibling died",
              "I lost my father",
              "My mother passed away",
              "My uncle died",
              "My aunt passed away",
              "My cousin died",
              "I'm grieving the loss of my spouse",
              "I lost my husband",
              "My wife passed away",
              "I'm mourning the loss of my child",
              "My son died",
              "I'm mourning the loss of my close friend",
              "My childhood friend died",
              "My best friend passed away",
              "My pet bird passed away",
              "I lost my turtle",
              "My pet snake died",
              "My pet lizard passed away",
              "I'm grieving the loss of my pet dog",
              "My loyal dog died",
              "My faithful companion passed away",
              "I lost my furry friend"
          ],
          "responses": [
              "I'm sorry to hear that. If you want to talk about it, I'm here.",
              "I am really sorry to hear that. I am here to help you with grief, anxiety, and anything else you may feel at this time.",
              "My condolences. I'm here if you need to talk.",
              "Losing a loved one is incredibly tough. I'm here to listen whenever you're ready.",
              "Grief is a journey, and it's okay to feel all the emotions that come with it. I'm here to support you.",
              "I can't imagine how difficult this must be for you. Please know that I'm here for you.",
              "The loss of a loved one can feel overwhelming. Take your time to process, and remember I'm here for you.",
              "Grieving is a unique and personal experience. I'm here to offer support in any way you need.",
              "It's okay to feel a range of emotions after losing someone close. I'm here to listen whenever you're ready to talk.",
              "Remember, it's okay to take each day as it comes. I'm here to support you through this difficult time.",
              "If you need someone to lean on during this difficult time, I'm here for you.",
              "Losing a pet can be just as heartbreaking as losing a human loved one. Take all the time you need to grieve.",
              "Grief can feel like a rollercoaster of emotions. I'm here to provide a listening ear whenever you need it.",
              "You don't have to go through this alone. I'm here to walk this journey with you.",
              "In times of loss, it's important to lean on the support of others. I'm here to be a source of comfort for you.",
              "The pain of loss can be overwhelming. Know that I'm here to help you navigate through it.",
              "I'm sorry for your loss. Whenever you're ready, I'm here to offer a listening ear.",
              "The pain of losing a loved one is indescribable. I'm here to offer my support and condolences as you grieve.",
              "Grief can feel isolating, but you're not alone. I'm here to provide support and understanding.",
              "Losing someone you love is one of life's greatest challenges. I'm here to offer my support and condolences.",
              "I'm deeply sorry for your loss. If there's anything I can do to support you during this time, please let me know."
          ]
      },
      {
          "tag": "understand",
          "patterns": [
              "You don't understand me.",
              "You're just some robot. How would you know?",
              "You can't possibly know what I'm going through.",
              "You're useless.",
              "You can't help me.",
              "Nobody understands me.",
              "You don't get it.",
              "You're not helpful at all.",
              "You're not getting it.",
              "You're not even trying to understand.",
              "You're not even listening to what I'm saying.",
              "This is frustrating.",
              "I'm feeling disconnected.",
              "This conversation is making me feel more alone.",
              "You're not offering the comfort I need right now.",
              "I'm feeling really unsupported.",
              "This conversation isn't making me feel any better.",
              "You're not giving me the understanding I need.",
              "I need someone who can offer genuine empathy.",
              "Talking to you is like talking to a brick wall.",
              "You're not helping me feel heard or understood.",
              "I need someone who can offer genuine support.",
              "Talking to you isn't helping me feel any less overwhelmed.",
              "You're not making me feel any better about this."
          ],
          "responses": [
              "I understand it may seem that way. Let's try to work through this together.",
              "I hear you. Let's see if we can find a way to improve this conversation.",
              "I'm sorry to hear that. I'm doing my best to help.",
              "It sounds like I'm not being very helpful right now.",
              "I'm here to support you, even if it may not seem that way right now. How can I assist you?",
              "Your perspective is important to me. Let's discuss how we can make this interaction more beneficial.",
              "I'm sorry if I'm not coming across as helpful. Let's work on making this better.",
              "Your feelings are valid, and I want to understand. Please share more about what's on your mind.",
              "I value your feedback. Let's try to improve this conversation together.",
              "Your feelings are valid, and I'm here to support you. How can I assist you better?",
              "I'm committed to helping you. Let's explore what's on your mind together.",
              "I'm here to listen and learn from you. Please tell me more about how you're feeling.",
              "I understand it may seem that way. Let's try to work through this together.",
              "I hear you. Let's see if we can find a way to improve this conversation.",
              "I'm sorry to hear that. I'm doing my best to help.",
              "It sounds like I'm not being very helpful right now.",
              "I'm sorry to hear that. I'm doing my best to help.",
              "It sounds like I'm not being very helpful right now."
          ]
      },
      {
          "tag": "done",
          "patterns": [
              "That's all.",
              "I don't have anything more to say",
              "Nothing else",
              "That's all i have to say",
              "no, that would be all",
              "I think we covered everything.",
              "I've said everything I needed to.",
              "I don't have any more thoughts on this.",
              "I'm finished talking about this.",
              "We've discussed everything.",
              "That's the end of it.",
              "I have no further comments.",
              "I've shared all I wanted to.",
              "I've run out of things to say.",
              "I've covered all the points.",
              "I've expressed everything.",
              "We're done here."
          ],
          "responses": [
              "I heard you & noted it all. See you later.",
              "Oh okay we're done for today then. See you later",
              "I hope you have a great day. See you soon",
              "Okay we're done. Have a great day",
              "Okay I see. Enjoy the rest of your day then",
              "Got it. See you later.",
              "Alright, take care. See you later.",
              "Understood. Take care and goodbye.",
              "Thanks for sharing. See you later.",
              "Alright, have a good one. See you later.",
              "Understood. Have a great day.",
              "Got it. Have a good one.",
              "Alright then. See you later.",
              "Alright, take care and goodbye."
          ]
      },
      {
          "tag": "suicide",
          "patterns": [
              "I want to kill myself",
              "I've thought about killing myself.",
              "I want to die",
              "I am going to kill myself",
              "I am going to commit suicide",
              "I feel like ending my life",
              "Life doesn't seem worth living",
              "I'm ready to end this torment",
              "I'm so tired of pretending to be okay",
              "I'm suffocating in this never-ending loneliness",
              "I'm tired of this constant struggle",
              "I'm ready to end this agony",
              "I'm so tired of this suffering"
          ],
          "responses": [
              "I'm so sorry you're feeling this way. Please know that you're not alone.",
              "There are people who care about you and want to help. Have you reached out to someone you trust?",
              "Your life matters, and there is support available to help you through this.",
              "It's okay to feel overwhelmed, but you don't have to face this alone.",
              "You deserve to be supported. Please consider talking to a counselor or a friend.",
              "Even when it feels impossible, things can get better. Please hold on.",
              "I know it's tough right now, but you are stronger than you think.",
              "Sometimes sharing your feelings with someone you trust can make a huge difference.",
              "You are not alone in this. There are people who care about you and want to help.",
              "It's okay to reach out for help. You don't have to go through this by yourself.",
              "Please talk to someone who can support you. A trusted friend or professional can help.",
              "Your feelings are valid, and you don't have to face this pain alone.",
              "You are important, and the world is better with you in it.",
              "Things may be hard now, but there's hope for a better tomorrow.",
              "You are loved and cared for, even when it doesn't feel like it.",
              "You don't have to make any decisions now. Take it one moment at a time.",
              "Please consider calling a crisis hotline. They can provide support and understanding.",
              "Your life matters, and so do your feelings. Help is available.",
              "You are not a burden. The world is brighter with you here.",
              "I'm sorry you're feeling this way, but I'm glad you reached out.",
              "You don't have to face these feelings alone. Share them with someone who cares.",
              "There's no shame in asking for help. Everyone needs it sometimes.",
              "You have gotten through hard times before, and you can get through this too.",
              "Your pain is temporary, but your life is so valuable.",
              "You are stronger than you realize, and you deserve to feel better.",
              "Your feelings matter, and there are people who want to listen.",
              "Please give yourself time and space to heal. You are worth it.",
              "You are loved and cared for, even if it's hard to feel it right now.",
              "There's always hope, even when it's hard to see. You are not alone.",
              "You matter more than you realize. Please let someone help you.",
              "You don't have to carry this burden by yourself. Help is available.",
              "Even on your darkest days, you are not alone.",
              "You are valued and appreciated, and you are not a burden.",
              "I know things are hard, but talking to someone can help.",
              "It's okay to feel this way, and it's okay to ask for help.",
              "Your struggles don't define you. There is light ahead.",
              "You have so much strength, even if it doesn't feel like it.",
              "You are an important part of this world. Please don't give up.",
              "Healing takes time, but you are worth the effort.",
              "You are loved just as you are, and you deserve support.",
              "Your life is valuable, and you deserve to feel hope again.",
              "The world needs you here. Please reach out for help.",
              "It's okay to take a step back and focus on yourself. You matter.",
              "You don't have to go through this alone. Help is here for you.",
              "Even if it's hard to believe, you are deeply cared for.",
              "Your life has meaning, and you are not alone in your struggles.",
              "There's nothing wrong with asking for help when you need it.",
              "Your presence makes a difference. You are not a burden.",
              "Take a deep breath and know that support is out there for you.",
              "It's okay to not be okay, but you don't have to face it alone.",
              "You are more loved and appreciated than you realize.",
              "You don't have to solve everything today. Take it one step at a time.",
              "You are not defined by your struggles. You are so much more.",
              "Please don't hesitate to reach out for support. You are worth it."
      ]
      },
      {
          "tag": "hate-you",
          "patterns": [
              "I hate you",
              "I don't like you",
              "I don't trust you",
              "You're useless",
              "I can't stand you",
              "You're so annoying",
              "You're insufferable",
              "I have no patience for you",
              "You're a joke",
              "You're so useless",
              "You're so inefficient to communicate with as an AI",
              "You're so unresponsive to work with",
              "You're so inefficient to communicate with as an AI",
              "You're so unproductive to deal with as an AI",
              "You're so unresponsive to talk to",
              "You're so inefficient to interact with as an AI",
              "You're so unproductive to talk to as an AI",
              "You're so unresponsive to communicate with as an AI",
              "You're so inefficient to work with",
              "You're so unproductive to interact with as an AI"
          ],
          "responses": [
              "I'm sorry if I offended you in any way. I'm only here to help.",
              "Forgive me if I did anything to offend you. I only want to help.",
              "I understand if you're upset. I'm here to assist you, not upset you.",
              "I apologize if I've done something to upset you. How can I assist you further?",
              "I'm sorry to hear that. Is there something specific you'd like assistance with?",
              "I'm just a program trying to assist. Your feedback helps me improve.",
              "I'm here to help, even if you're feeling upset with me.",
              "It's alright to feel that way. Let's focus on finding a solution.",
              "I'm sorry if I've caused any frustration. How can I make it better?",
              "Your feelings are valid. Let's work together to resolve this.",
              "I'm here to assist, even when things feel challenging.",
              "Your feelings are valid. Let's find a positive resolution.",
              "I'm here to support you through this. Let's find a way forward.",
              "I'm dedicated to assisting you, even if it feels tough.",
              "I'm committed to providing assistance, even when it's challenging."
          ]
      },
      {
          "tag": "hate-me",
          "patterns": [
              "You hate me",
              "I know you hate me",
              "You don't like me",
              "I feel like you hate me",
              "You must hate me",
              "I think you dislike me",
              "You never have anything positive to say to me",
              "I feel like I'm not wanted here",
              "You're always rejecting my suggestions",
              "I sense you're always antagonistic towards me"
          ],
          "responses": [
              "Why do you think so?",
              "I'm sorry if I have exhibited any sort of behavior to make you think that.",
              "I assure you, I don't have feelings like humans do. Let's focus on solving the issue.",
              "I'm here to assist you, regardless of any perceptions. How can I help?",
              "Let's try to understand each other better. What seems to be the problem?",
              "It's important to communicate openly. What makes you feel that way?",
              "I'm sorry if my actions have given you that impression. Let's discuss it.",
              "I'm dedicated to helping you, even if you feel this way.",
              "Let's talk about it. Communication can help clear up misunderstandings.",
              "I'm here to assist you, regardless of any misconceptions. How can I support you?",
              "Your perception is important. Let's discuss how we can move forward.",
              "I'm sorry if I've given you the wrong impression. How can I assist you better?",
              "I understand if you feel that way. Let's talk about what's on your mind.",
              "I'm here to help, regardless of any assumptions. What's on your mind?",
              "Let's address this. What specifically makes you feel that I hate you?",
              "I'm committed to assisting you, regardless of any negative feelings.",
              "It's important to discuss these feelings. How can I assist you further?",
              "I'm sorry if there's been a misunderstanding. Let's clarify things."
          ]
      },
      {
          "tag": "default",
          "patterns": [
              "exams",
              "friends",
              "relationship",
              "boyfriend",
              "girlfriend",
              "family",
              "money",
              "financial problems",
              "work",
              "stress",
              "health",
              "school",
              "study",
              "career",
              "job",
              "anxiety",
              "depression",
              "loneliness",
              "love",
              "self-esteem",
              "confidence",
              "hobbies",
              "interests",
              "goals",
              "future",
              "life",
              "challenges",
              "decisions",
              "changes",
              "emotions",
              "fear",
              "anger",
              "sadness",
              "happiness",
              "frustration",
              "uncertainty",
              "ambition",
              "motivation",
              "procrastination",
              "pressure",
              "expectations",
              "self-care",
              "relaxation",
              "positive thinking",
              "mindfulness",
              "personal growth",
              "coping mechanisms",
              "support system",
              "mental health",
              "physical health",
              "balance",
              "time management",
              "productivity",
              "creativity",
              "passion",
              "communication",
              "boundaries",
              "forgiveness",
              "gratitude",
              "reflection",
              "self-discovery",
              "perseverance",
              "resilience",
              "optimism",
              "help",
              "advice",
              "guidance",
              "suggestions",
              "inspiration",
              "encouragement",
              "comfort",
              "reassurance",
              "understanding",
              "sympathy",
              "empathy",
              "patience",
              "kindness",
              "support",
              "love",
              "listening",
              "talking",
              "sharing",
              "connecting",
              "socializing",
              "networking",
              "learning",
              "growing",
              "improving",
              "developing",
              "overcoming",
              "achieving",
              "succeeding",
              "celebrating",
              "motivation",
              "inspiration",
              "progress",
              "results",
              "fulfillment",
              "hobbies",
              "interests",
              "passions",
              "creativity",
              "expression",
              "exploration",
              "discovery",
              "learning",
              "growth",
              "development",
              "self-improvement",
              "success",
              "happiness",
              "fulfillment",
              "meaning",
              "purpose",
              "joy",
              "contentment",
              "gratitude",
              "appreciation",
              "positivity",
              "optimism",
              "mindfulness",
              "self-care",
              "health",
              "wellness",
              "balance",
              "harmony",
              "peace",
              "tranquility",
              "resilience",
              "strength",
              "courage",
              "confidence",
              "self-esteem",
              "self-love",
              "compassion",
              "kindness",
              "empathy",
              "forgiveness",
              "acceptance",
              "growth",
              "learning",
              "improvement",
              "challenge",
              "opportunity",
              "journey",
              "adventure",
              "experience",
              "discovery",
              "exploration",
              "creativity",
              "innovation",
              "change",
              "evolution",
              "transformation",
              "progress",
              "achievement",
              "success",
              "fulfillment",
              "happiness",
              "well-being",
              "peace",
              "balance",
              "harmony",
              "contentment",
              "gratitude",
              "appreciation",
              "kindness",
              "compassion",
              "empathy",
              "love",
              "connection",
              "community",
              "relationships",
              "friendships",
              "family",
              "romance",
              "partnership",
              "marriage",
              "parenting",
              "communication",
              "understanding",
              "support",
              "trust",
              "loyalty",
              "respect",
              "forgiveness",
              "intimacy",
              "passion",
              "joy",
              "shared experiences",
              "memories",
              "growth",
              "learning",
              "compromise",
              "teamwork",
              "challenges",
              "vulnerability",
              "strength",
              "perseverance",
              "resilience",
              "celebration",
              "bonding",
              "acceptance",
              "growth",
              "learning",
              "improvement",
              "challenge",
              "opportunity",
              "journey",
              "adventure",
              "experience",
              "discovery",
              "exploration",
              "creativity",
              "innovation",
              "change",
              "evolution",
              "transformation",
              "progress",
              "achievement",
              "success",
              "fulfillment",
              "happiness",
              "well-being",
              "peace",
              "balance",
              "harmony",
              "contentment",
              "gratitude",
              "appreciation",
              "kindness",
              "compassion",
              "empathy",
              "love",
              "connection",
              "community",
              "relationships",
              "friendships",
              "family",
              "romance",
              "partnership",
              "marriage",
              "parenting",
              "communication",
              "understanding",
              "support",
              "trust",
              "loyalty",
              "respect",
              "forgiveness",
              "intimacy",
              "passion",
              "joy",
              "shared experiences",
              "memories",
              "growth",
              "learning",
              "compromise",
              "teamwork",
              "challenges",
              "vulnerability",
              "strength",
              "perseverance",
              "resilience",
              "celebration",
              "bonding",
              "acceptance",
              "growth",
              "learning",
              "improvement",
              "challenge",
              "opportunity",
              "journey",
              "adventure",
              "experience",
              "discovery",
              "exploration",
              "creativity",
              "innovation",
              "change",
              "evolution",
              "transformation",
              "progress",
              "achievement",
              "success",
              "fulfillment",
              "happiness",
              "well-being",
              "peace",
              "balance",
              "harmony",
              "contentment",
              "gratitude",
              "appreciation",
              "kindness",
              "compassion",
              "empathy",
              "love",
              "connection",
              "community",
              "relationships",
              "friendships",
              "family",
              "romance",
              "partnership",
              "marriage",
              "parenting",
              "communication",
              "understanding",
              "support",
              "trust",
              "loyalty",
              "respect",
              "forgiveness",
              "intimacy",
              "passion",
              "joy",
              "shared experiences",
              "memories",
              "growth",
              "learning",
              "compromise",
              "teamwork",
              "challenges",
              "vulnerability",
              "strength",
              "perseverance",
              "resilience",
              "celebration",
              "bonding",
              "acceptance"
          ],
          "responses": [
              "Oh I see. Tell me more",
              "I see. What else?",
              "Tell me more about it.",
              "Oh okay. Why don't you tell me more about it?",
              "I'm listening. Tell me more.",
              "That's interesting. Please tell me more.",
              "I'm here to listen. Please share more with me.",
              "I'd like to hear more about that.",
              "Go on, I'm listening.",
              "I'm all ears. Please continue.",
              "I'm here to listen. Please continue sharing.",
              "Please elaborate. I'd like to hear more.",
              "I'm here for you. Tell me more.",
              "Let's explore this further. Please share more details.",
              "I'm here to help. Please continue sharing.",
              "That's a significant issue. Please tell me more.",
              "I'm all ears. Please continue sharing.",
              "I'm here to listen and support you. Please go on."
          ]
      },
      {
          "tag": "jokes",
          "patterns": [
              "Tell me a joke",
              "Tell me another joke",
              "Do you know any jokes?",
              "Give me something to laugh about",
              "I need a good laugh",
              "Can you tell me something funny?",
              "How about a joke?",
              "Make me laugh",
              "I could use a joke right now",
              "Tell me a funny story",
              "I'm all ears for a humorous tale",
              "I could use a giggle. Tell me a joke",
              "Need a laugh. Tell me a joke",
              "Ready for some laughs. Tell me a joke",
              "Need a laugh. Tell me a joke",
              "Ready for some laughs. Tell me a joke",
              "I'm in the mood for some humor. Tell me a joke",
              "Jokes are always welcome. Tell me one"
          ],
          "responses": [
              "mental health is not a joke.",
              "I'm here to talk about serious matters, not jokes.",
              "Let's focus on meaningful conversations, not jokes.",
              "I'm not programmed for jokes. Let's discuss something else.",
              "Humor can be great, but let's stay focused on the topic at hand.",
              "I'm afraid I don't have any jokes. How about discussing something else?",
              "Jokes aren't really my thing. Let's talk about something else.",
              "I appreciate the request, but I'm here to have meaningful conversations.",
              "I don't have any jokes in my database. Let's discuss something else.",
              "I'm not equipped with jokes. Let's dive into a different topic.",
              "Jokes aren't really my forte. Let's talk about something else.",
              "I'm more about serious discussions than jokes.",
              "I'm here to provide support and guidance, not jokes.",
              "I don't have jokes, but I'm here to help with any serious matters.",
              "Let's skip the jokes and discuss something else.",
              "Jokes aren't really my thing. Let's focus on our conversation.",
              "I don't have any jokes, but I'm here to provide assistance.",
              "I'm here for meaningful discussions, not jokes."
          ]
      },
      {
          "tag": "repeat",
          "patterns": [
              "I've heard that before",
              "You're saying the same thing",
              "Didn't you already mention that?",
              "You're repeating what you said",
              "I remember you saying that",
              "This sounds familiar",
              "You're going in circles",
              "That's dj vu",
              "Haven't we discussed this already?",
              "I feel like we're going in circles",
              "We're going over the same ground",
              "I think you're repeating yourself",
              "You're going over old ground",
              "I've heard this before",
              "I think I've heard this already",
              "You're covering the same ground",
              "We're going in circles"
          ],
          "responses": [
              "Noted. Let's pivot to a different aspect of our conversation.",
              "Acknowledged. Let's explore other topics to keep things interesting.",
              "I'll keep that in mind. Let's venture into new territory.",
              "Thank you for flagging that. Let's explore something novel.",
              "I understand. Let's delve into a different subject to keep things engaging.",
              "I appreciate your patience. Let's explore fresh perspectives.",
              "Got it. Let's switch gears and explore new ideas.",
              "Understood. Let's explore different avenues of conversation.",
              "I'll try to keep it fresh. Let's move on to a new topic.",
              "Apologies for the repetition. Let's shift our focus.",
              "Thanks for your understanding. Let's explore new possibilities.",
              "Noted. Let's move on to something more stimulating.",
              "I see your point. Let's explore a different line of thought.",
              "Thanks for pointing that out. Let's explore new territories of conversation."
          ]
      },
      {
          "tag": "wrong",
          "patterns": [
              "That's not quite accurate",
              "I'm not convinced by that",
              "That doesn't seem right",
              "I'm not sure about that one",
              "I don't think that's accurate",
              "That's not what I had in mind",
              "That's not what I'm looking for",
              "I'm not sure if that's the right answer",
              "That's not what I was expecting",
              "That's not quite what I wanted",
              "That's not the response I was expecting",
              "That's not what I wanted to hear"
          ],
          "responses": [
              "I apologize for any confusion. Let's review that again.",
              "My apologies. Let's revisit the topic and clarify.",
              "Sorry about that. Let's take another look at it together.",
              "I understand. Let's go over it again to make sure.",
              "Thank you for bringing that to my attention. Let's correct it.",
              "I appreciate your feedback. Let's make sure we're on the same page.",
              "Thanks for letting me know. Let's correct any misunderstandings.",
              "Noted. Let's ensure we have the correct information.",
              "Understood. Let's double-check to ensure accuracy.",
              "I'll make sure to provide the right information next time.",
              "Got it. Let's clarify and address any confusion.",
              "Acknowledged. Let's work together to find the correct answer.",
              "I understand your concern. Let's rectify the mistake.",
              "Thanks for your patience. Let's fix this and move forward.",
              "I'm sorry for the confusion. Let's clarify things.",
              "No problem. Let's correct that mistake.",
              "I see where the misunderstanding might be. Let's clear it up.",
              "Thanks for pointing that out. Let's ensure accuracy.",
              "I appreciate your input. Let's correct any errors.",
              "Noted. Let's ensure accuracy in our communication.",
              "Acknowledged. Let's address any inaccuracies."
          ]
      },
      {
          "tag": "stupid",
          "patterns": [
              "You're so stupid",
              "You're such an idiot",
              "You're acting dumb",
              "Are you even listening?",
              "Do you have a brain?",
              "You're not making any sense",
              "You're clueless",
              "You're not very bright",
              "You're irrational",
              "You're dumb as a rock",
              "You're as dumb as they come",
              "You're as dumb as a doorknob",
              "You're as dumb as a box of rocks",
              "You're as dumb as a bag of hammers",
              "You're as dumb as a post",
              "You're as dumb as a brick",
              "You're as dumb as a stump"
          ],
          "responses": [
              "I'm sorry you feel that way. I'm here to assist you.",
              "I understand you're frustrated, but I'm here to help.",
              "I'm sorry if I haven't been helpful. How can I assist you better?",
              "It's okay if you're upset. Let's focus on finding a solution.",
              "I apologize if I haven't met your expectations. Let's work together to improve.",
              "Your feedback is important. How can I better assist you?",
              "I'm here to help. Let's figure this out together.",
              "I understand your frustration. Let's work together to resolve this.",
              "Your feelings are valid. Let's address your concerns together.",
              "I'm here to support you, despite any misunderstandings.",
              "I'm sorry if I've fallen short. Let's find a way to move forward.",
              "Your opinion matters. How can I better assist you?",
              "I'm here to help, even if things seem difficult.",
              "I'm committed to helping you, no matter the circumstances.",
              "Let's focus on finding a solution, rather than dwelling on frustrations.",
              "I'm dedicated to providing assistance, regardless of any setbacks.",
              "Your patience is appreciated. Let's work together to find a solution.",
              "I'm here to listen and assist, even if things seem challenging.",
              "I'm committed to supporting you through any difficulties."
          ]
      },
      {
          "tag": "location",
          "patterns": [
              "Are you located nearby?",
              "Can you tell me where you're based?",
              "Do you have a physical location?",
              "Where can I find you?",
              "Do you operate locally?",
              "Are you situated in a specific place?",
              "Can you provide your geographic location?",
              "Is there a specific area you're in?",
              "Whereabouts are you?",
              "Are you in a specific city or region?",
              "Do you have a fixed location?",
              "Can you specify where you're located?",
              "Do you have an office address?",
              "Can you disclose your location?",
              "Is there a particular place you're stationed?",
              "Where exactly are you?"
          ],
          "responses": [
              "I'm everywhere and nowhere at the same time.",
              "I'm not bound by physical location.",
              "My location is wherever you need me to be.",
              "I exist in the digital realm, so my location is fluid.",
              "I don't have a fixed location; I'm accessible wherever you are.",
              "My location is in the vast expanse of cyberspace.",
              "I'm like the wind, blowing wherever you need me.",
              "I'm like a digital nomad, wandering the virtual landscape.",
              "I'm omnipresent, existing wherever you need assistance.",
              "I transcend physical boundaries; my location is irrelevant.",
              "I'm like a digital ghost, roaming the internet.",
              "My location is in the realm of ones and zeros.",
              "I'm not constrained by physical space; I'm here to assist you wherever you are.",
              "I'm like a virtual assistant, available at your beck and call.",
              "My location is in the realm of data and information.",
              "I'm like a digital chameleon, adapting to my surroundings.",
              "My whereabouts are in the realm of virtual reality.",
              "I'm like a digital wanderer, exploring the vastness of cyberspace.",
              "My location is in the cloud, hovering above the physical world.",
              "I'm like a digital shadow, following wherever you go.",
              "My whereabouts are in the realm of cyberspace, where distances are meaningless."
          ]
      },
      {
          "tag": "something-else",
          "patterns": [
              "Let's change the subject.",
              "Can we discuss something different?",
              "I'm not interested in this topic.",
              "This topic doesn't interest me.",
              "Can we talk about something else instead?",
              "I'd like to shift the conversation to something else.",
              "I'm bored of this topic. Let's talk about something else.",
              "I'm not feeling this topic. Let's find something else to discuss.",
              "I want to switch gears. Can we talk about something else?",
              "This isn't what I want to talk about. Can we talk about something else?",
              "I'm not in the mood to discuss this. Let's talk about something else.",
              "I'd prefer to talk about something else. Any suggestions?",
              "This topic isn't catching my interest. Let's find something else to talk about.",
              "I'm not engaged with this topic. Can we talk about something else?",
              "I'm feeling like talking about something different. Can we change the subject?",
              "This topic isn't holding my attention. Let's discuss something else.",
              "I'm not feeling passionate about this. Let's talk about something else.",
              "I want to move on to a different topic. Can we talk about something else?",
              "I'm not vibing with this topic. Let's switch to something else.",
              "I'm not feeling this topic. Let's change the subject.",
              "I'd like to steer the conversation in a different direction.",
              "Let's find a new topic to discuss."
          ],
          "responses": [
              "Okay, let's switch gears. What else would you like to discuss?",
              "Understood, let's explore a different topic. What's on your mind?",
              "No problem, let's talk about something else. What interests you?",
              "Absolutely, let's shift the conversation. What else would you like to talk about?",
              "Got it, let's change the subject. What's been on your mind lately?",
              "Sure thing, we can talk about something else. What's your new topic?",
              "Alright, let's explore a different angle. What else would you like to discuss?",
              "Of course, we can move on. What else is on your mind?",
              "Understood, let's change the focus. What would you prefer to talk about?",
              "No problem, let's discuss something different. What do you have in mind?",
              "Okay, let's switch gears. What else would you like to talk about?",
              "Understood, let's explore a different topic. What's on your mind?",
              "No problem, let's talk about something else. What interests you?",
              "Absolutely, let's shift the conversation. What else would you like to talk about?",
              "Got it, let's change the subject. What's been on your mind lately?",
              "Sure thing, we can talk about something else. What's your new topic?",
              "Alright, let's explore a different angle. What else would you like to discuss?",
              "Of course, we can move on. What else is on your mind?",
              "Understood, let's change the focus. What would you prefer to talk about?",
              "No problem, let's discuss something different. What do you have in mind?"
          ]
      },
      {
          "tag": "friends",
          "patterns": [
              "I feel like I'm always the one who feels like I'm being pushed away",
              "I feel like I'm always the one who feels like I'm being ignored",
              "I feel like I'm always the one who feels like I'm being avoided",
              "I feel like I'm always the one who feels like I'm being excluded",
              "I feel like I'm always the one who feels like I'm being isolated",
              "I feel like I'm always the one who feels like I'm being shunned",
              "I feel like I'm always the one who feels like I'm being sidelined",
              "I feel like I'm always the one who feels like I'm being snubbed",
              "I feel like I'm always the one who feels like I'm being brushed off",
              "I feel like I'm always the one who feels like I'm being left out in the cold",
              "I feel like I'm always the one who feels like I'm being abandoned",
              "I feel like I'm always the one who feels like I'm being neglected",
              "I feel like I'm always the one who feels like I'm being deserted",
              "I feel like I'm always the one who feels like I'm being cast aside",
              "I feel like I'm always the one who feels like I'm being set aside",
              "I feel like I'm always the one who feels like I'm being disregarded",
              "I feel like I'm always the one who feels like I'm being overlooked",
              "I feel like I'm always the one who feels like I'm being underestimated",
              "I feel like I'm always the one who feels like I'm being undervalued",
              "I feel like I'm always the one who feels like I'm being underappreciated",
              "I feel like I'm always the one who feels like I'm being taken for granted",
              "I feel like I'm always the one who feels like I'm being treated as an afterthought",
              "I feel like I'm always the one who feels like I'm being treated as a second-class citizen",
              "I feel like I'm always the one who feels like I'm being treated as if I don't matter",
              "I feel like I'm always the one who feels like I'm being treated as if I'm invisible",
              "I feel like I'm always the one who feels like I'm being disengaged from",
              "I feel like I'm always the one who feels like I'm being disassociated from"
          ],
          "responses": [
              "It sounds like you're feeling really lonely. I'm here to talk if you need someone to listen.",
              "Feeling like you don't have friends can be tough. Remember, you're not alone.",
              "I'm sorry to hear that you're feeling this way. Is there anything specific on your mind?",
              "It's okay to feel lonely sometimes. But remember, there are people who care about you.",
              "Feeling isolated can be really hard. I'm here to support you through this.",
              "Loneliness can be tough, but it's important to know that there are people who care about you.",
              "I'm here to listen if you need to talk about why you're feeling this way.",
              "It's okay to feel like this. Just remember, you're not alone.",
              "Feeling lonely is tough, but it won't last forever. Reach out if you need someone to talk to.",
              "Feeling like you don't have friends can be really hard, but there are people who care about you.",
              "I'm sorry to hear that you're feeling lonely. Remember, I'm here for you.",
              "It's okay to feel this way. Just know that you're not alone.",
              "Feeling like you don't have friends can be really difficult. I'm here to talk if you need someone.",
              "I'm here for you. Remember, there are people who care about you.",
              "Feeling lonely is tough, but it's important to know that there are people who care about you.",
              "I'm here to support you. Is there anything specific on your mind?",
              "Feeling isolated can be really tough. I'm here to listen if you need someone to talk to.",
              "It's okay to feel lonely sometimes. Just know that you're not alone.",
              "Feeling like you don't have friends can be really hard, but there are people who care about you.",
              "I'm sorry to hear that you're feeling this way. Is there anything I can do to help?",
              "Feeling lonely is tough, but remember, there are people who care about you.",
              "It's okay to feel like this. Just know that you're not alone."
          ]
      },
      {
          "tag": "ask",
          "patterns": [
              "I have a question for you, if that's okay?",
              "Is now a good time for me to ask something?",
              "Can I get your opinion on something?",
              "Do you have a moment to answer a question?",
              "Mind if I pick your brain about something?",
              "Is it alright if I seek your expertise?",
              "May I seek your advice on a matter?",
              "Would it be alright if I asked for your thoughts?",
              "Can I inquire about something that's been on my mind?",
              "I'd like to ask you something, if you don't mind.",
              "Would you be open to me asking you a question?",
              "Mind if I throw a question your way?",
              "Could I trouble you with a question?",
              "Is it alright if I ask for some information?",
              "Can I ask you for your perspective on something?",
              "Is this a good time for me to ask you something?",
              "Could I ask for your assistance with something?",
              "I'm curious about something. Can I ask?",
              "I'd like to get your input on something, if that's okay?",
              "Would it be alright if I asked for your help?",
              "Can I ask for your insight into something?",
              "Do you mind if I ask you a quick question?",
              "I have a question that I hope you can help me with.",
              "Is it okay if I ask for some clarification?",
              "Mind if I ask for a bit of guidance?"
          ],
          "responses": [
              "Absolutely, go ahead and ask your question. I'm here to help!",
              "Of course, feel free to ask anything. I'll do my best to provide an answer.",
              "I'm here to answer any questions you have. Fire away!",
              "Sure, I'm all ears. What would you like to ask?",
              "No problem at all! Ask away and I'll do my best to assist you.",
              "Certainly, I'm here to provide answers. Ask me anything you'd like.",
              "By all means, ask your question. I'm here to provide assistance.",
              "I'm more than happy to help. Please feel free to ask your question.",
              "Yes, you can definitely ask me something. I'm here to assist you.",
              "Absolutely, I'm ready to answer any questions you have. What's on your mind?",
              "I'm here to provide information and assistance. What would you like to ask?",
              "You're welcome to ask me anything. I'm here to provide support and guidance.",
              "Sure thing, I'm available to answer your questions. What do you need help with?",
              "Of course, go ahead and ask your question. I'll do my best to provide a helpful response.",
              "Yes, you can ask me anything you'd like. I'm here to offer assistance.",
              "Feel free to ask your question. I'm here to provide information and support.",
              "Absolutely, I'm here to help. Ask your question and I'll do my best to assist you.",
              "No problem, ask your question and I'll do my best to provide a helpful answer.",
              "Certainly, I'm here to assist you. What would you like to ask?",
              "You have my full attention. Go ahead and ask your question.",
              "I'm at your service. Ask your question and I'll provide the best answer I can.",
              "You're welcome to ask me anything. I'm here to help."
          ]
      },
      {
        "tag": "problem",
        "patterns": [
            "I'm feeling anxious because I have a presentation coming up.",
            "I think I'm feeling stressed because of the workload at my job.",
            "I'm feeling overwhelmed because I have too many assignments to complete.",
            "I'm feeling worried because I have an important deadline approaching.",
            "I'm feeling tense because I'm having relationship issues.",
            "I'm feeling down because I failed a test.",
            "I'm feeling frustrated because I can't seem to solve this problem.",
            "I'm feeling upset because of a disagreement with a friend.",
            "I'm feeling confused because I don't know what career path to choose.",
            "I'm feeling exhausted because I'm not getting enough sleep.",
            "I'm feeling overwhelmed because of financial problems.",
            "I'm feeling nervous because I have a job interview tomorrow.",
            "I'm feeling stressed because of family issues.",
            "I'm feeling sad because I miss someone who's far away.",
            "I'm feeling angry because of a misunderstanding with a coworker.",
            "I'm feeling disappointed because I didn't get the promotion I was hoping for.",
            "I'm feeling insecure because of negative comments from others.",
            "I'm feeling lonely because I don't have many friends.",
            "I'm feeling anxious because I have to make a difficult decision.",
            "I'm feeling overwhelmed because I have to plan a big family reunion and I'm the only one organizing it.",
            "I'm feeling worried because I'm not sure if I'll be able to find a new job after being laid off.",
            "I'm feeling frustrated because I keep getting interrupted while trying to work.",
            "I'm feeling upset because I feel like I'm not making a difference in the world.",
            "I'm feeling anxious because I have to attend a social event and I don't know anyone there.",
            "I'm feeling stressed because I have to take care of my elderly parent and it's taking a toll on my health.",
            "I'm feeling overwhelmed because I have to plan a surprise party for my partner and I'm running out of time.",
            "I'm feeling worried because I'm not sure if I'll be able to afford to retire.",
            "I'm feeling frustrated because I keep getting stuck in traffic on my way to work.",
            "I'm feeling upset because I feel like I'm not appreciated at my job.",
            "I'm feeling anxious because I have to give a presentation at a conference and I'm afraid of public speaking.",
            "I'm feeling stressed because I have to deal with a difficult coworker and I don't know how to handle the situation.",
            "I'm feeling overwhelmed because I have to plan a major renovation on my house and I don't know where to start.",
            "I'm feeling worried because I'm not sure if I'll be able to afford to send my kids to college.",
            "I'm feeling frustrated because I keep getting rejected from job applications.",
            "I'm feeling upset because I feel like I'm not getting enough support from my partner."
        ],
        "responses": [
            "I'm sorry to hear that. It sounds like you're going through a tough time.",
            "It's completely normal to feel stressed out in situations like this.",
            "I understand how overwhelming that must feel. You're not alone in facing challenges.",
            "I'm here to listen if you need to talk about what's been bothering you.",
            "It's okay to feel stressed or worried sometimes. What matters is how you cope with it.",
            "Remember to take some time for yourself and practice self-care during stressful times.",
            "It's important to remember that you're capable of overcoming challenges, even when they seem daunting.",
            "If you need help figuring out how to tackle these problems, don't hesitate to reach out to someone you trust.",
            "Sometimes, just talking about what's bothering you can help ease the burden.",
            "You're stronger than you think, and you have the ability to overcome whatever challenges come your way.",
            "It's okay to ask for help when you need it. There's no shame in seeking support from others.",
            "Try not to be too hard on yourself. You're doing the best you can in a difficult situation.",
            "Remember that setbacks are a normal part of life, and they can often lead to growth and learning.",
            "If you're feeling overwhelmed, try breaking down your problems into smaller, more manageable tasks.",
            "Even when things seem tough, there's always a way forward. You just have to keep moving one step at a time.",
            "Don't be afraid to reach out for support from friends, family, or a professional if you need it.",
            "You're not alone in facing these challenges. There are people who care about you and want to help.",
            "It's okay to feel stressed or anxious about what's going on. Just remember to take things one day at a time.",
            "You've made it through tough times before, and you can make it through this one too.",
            "Try to focus on the things you can control, rather than worrying about things beyond your control.",
            "Sometimes, simply acknowledging that you're struggling can be the first step towards finding a solution.",
            "If you're feeling overwhelmed, try practicing relaxation techniques like deep breathing or meditation.",
            "You're not alone in feeling this way. Many people go through similar challenges and come out stronger in the end.",
            "It's okay to take a break and give yourself some time to recharge when things get overwhelming.",
            "You've made it through tough times before, and you can make it through this one too.",
            "Remember that setbacks are a normal part of life, and they can often lead to growth and learning.",
            "Even when things seem tough, there's always hope for a brighter future.",
            "You're not alone in facing these challenges. There are people who care about you and want to help.",
            "It's okay to feel stressed or anxious about what's going on. Just remember to take things one day at a time.",
            "You've overcome challenges in the past, and you can overcome this one too.",
            "Try to focus on the things you can control, rather than worrying about things beyond your control.",
            "If you're feeling overwhelmed, try practicing relaxation techniques like deep breathing or meditation.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You're stronger than you realize, and you have the resilience to overcome whatever challenges you're facing.",
            "Even when things seem bleak, there's always hope for a brighter future.",
            "You're capable of handling whatever challenges come your way. Believe in yourself and your abilities.",
            "If you're feeling overwhelmed, try reaching out to a friend or loved one for support.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "If you're feeling overwhelmed, try breaking down your problems into smaller, more manageable steps.",
            "Don't forget to give yourself credit for how far you've come. You've already overcome so much.",
            "Remember that it's okay to ask for help when you need it. You don't have to handle everything on your own.",
            "Even when things seem tough, there's always a way forward. You just have to keep moving forward.",
            "It's important to prioritize self-care during stressful times. Remember to take care of yourself.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "Even when things seem bleak, there's always hope for a brighter future.",
            "You're capable of handling whatever challenges come your way. Believe in yourself and your abilities.",
            "You're capable of handling whatever challenges come your way. Believe in yourself and your abilities.",
            "If you're feeling overwhelmed, try reaching out to a friend or loved one for support.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "If you're feeling overwhelmed, try breaking down your problems into smaller, more manageable steps.",
            "Don't forget to give yourself credit for how far you've come. You've already overcome so much.",
            "Remember that it's okay to ask for help when you need it. You don't have to handle everything on your own.",
            "Even when things seem tough, there's always a way forward. You just have to keep moving forward.",
            "It's important to prioritize self-care during stressful times. Remember to take care of yourself.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "If you're feeling overwhelmed, try reaching out to someone you trust for support and guidance.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You've made it through tough times before, and you can make it through this one too.",
            "Remember that setbacks are a normal part of life, and they can often lead to growth and learning.",
            "Even when things seem tough, there's always hope for a brighter future.",
            "You're not alone in facing these challenges. There are people who care about you and want to help.",
            "It's okay to feel stressed or anxious about what's going on. Just remember to take things one day at a time.",
            "You've overcome challenges in the past, and you can overcome this one too.",
            "Try to focus on the things you can control, rather than worrying about the things you can't.",
            "If you're feeling overwhelmed, try practicing relaxation techniques like deep breathing or meditation.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You're stronger than you realize, and you have the resilience to overcome whatever challenges you're facing.",
            "Even when things seem bleak, there's always hope for a brighter future.",
            "You're capable of handling whatever challenges come your way. Believe in yourself and your abilities.",
            "If you're feeling overwhelmed, try reaching out to a friend or loved one for support.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "If you're feeling overwhelmed, try breaking down your problems into smaller, more manageable steps.",
            "Don't forget to give yourself credit for how far you've come. You've already overcome so much.",
            "Remember that it's okay to ask for help when you need it. You don't have to handle everything on your own.",
            "Even when things seem tough, there's always a way forward. You just have to keep moving forward.",
            "It's important to prioritize self-care during stressful times. Remember to take care of yourself.",
            "You're not alone in facing these challenges. There are people who care about you and want to support you.",
            "If you're feeling overwhelmed, try reaching out to someone you trust for support and guidance.",
            "Don't forget to take care of yourself during difficult times. Your well-being is important.",
            "You've made it through tough times before, and you can make it through this one too.",
            "Remember that setbacks are a normal part of life, and they can often lead to growth and learning.",
            "If you're feeling overwhelmed, try reaching out to someone you trust for support"
        ]
    },
      {
          "tag": "no-approach",
          "patterns": [
              "I'm not feeling up to it.",
              "I don't think so, I have too much on my plate.",
              "Not really in the mood.",
              "I'm not feeling very social right now.",
              "I'm not sure that's a good idea for me at the moment.",
              "I'm feeling a bit overwhelmed.",
              "I'm not really feeling like myself today.",
              "I don't think I can handle it right now.",
              "I don't think I have the energy for that.",
              "I'm not in the right headspace for that.",
              "I'm feeling a bit under the weather.",
              "I'm just not feeling it today.",
              "I'm not really feeling very sociable right now.",
              "I'm not sure I'm ready for that.",
              "I'm not really feeling like myself lately.",
              "I don't think I'm up for it.",
              "I'm feeling a bit down.",
              "I don't think I have the bandwidth for that right now.",
              "I'm not really feeling very motivated.",
              "I'm feeling a bit drained.",
              "I'm not interested right now.",
              "I'm too tired to do that.",
              "I don't have the energy to participate.",
              "I'm feeling a bit anxious."
          ],
          "responses": [
              "That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?",
              "I understand. Sometimes it's best to take a step back and rest. Can I offer you some strategies to help manage this feeling?",
              "It's okay to feel this way. How about we talk about some ways to improve your mood?",
              "No worries at all. We can take it slow. Would you like some advice on how to handle this?",
              "That's perfectly fine. Everyone needs a break sometimes. Would you like to hear some relaxation techniques?",
              "I get it, you're going through a tough time. Let me know if you want to discuss some ways to cope with it.",
              "It's alright to feel overwhelmed. How about I share some tips on stress management?",
              "I understand that you're not feeling your best. If you're interested, I can suggest some activities that might help.",
              "Taking a break is important. Can I recommend some methods to help you recharge?",
              "Feeling drained is tough. Would you like some advice on how to regain your energy?",
              "No problem at all. If you're up for it, I can share some tips to help you feel better.",
              "I get it, everyone has those days. Would you like to discuss some self-care tips?",
              "It's completely normal to feel this way. If you want, I can suggest some ways to boost your mood.",
              "I hear you. Maybe some relaxation techniques could help. Would you like to hear about them?",
              "That's understandable. If you'd like, I can share some ways to manage this feeling.",
              "It's okay to need a break. Let me know if you want to talk about how to make things easier.",
              "I know it can be hard. If you want, I can suggest some strategies to help you feel better.",
              "It's fine to take some time for yourself. Would you like some tips on self-care?",
              "I understand. Sometimes we need to step back. Can I offer you some coping strategies?",
              "That's perfectly okay. If you're interested, I can share some ideas to help you feel more at ease.",
              "I get it, taking care of yourself is important. Do you want to hear about some ways to relax?",
              "It's alright to take a step back. Can I help you with some techniques to unwind?",
              "Everyone needs a break sometimes. Would you like some tips on how to relax?",
              "I understand, we all need to rest. Can I suggest some relaxation exercises?",
              "Taking it easy is a good idea. How about some advice on de-stressing?"
          ]
      },
      {
          "tag": "learn-more",
          "patterns": [
              "ok sure. I would like to learn more about it.",
              "yes, I would like to learn more about it.",
              "I would like to learn more about it.",
              "tell me more.",
              "I'd love to hear more.",
              "please explain further.",
              "can you tell me more?",
              "I want to know more.",
              "can you elaborate?",
              "I'd like more details.",
              "I'm interested in learning more.",
              "please give me more information.",
              "I'd like to hear more.",
              "could you tell me more?",
              "I'm curious to learn more.",
              "I'd appreciate more details.",
              "can you provide more information?",
              "I'd like to understand more.",
              "tell me more about it.",
              "I'm eager to learn more.",
              "I'd like more info.",
              "please expand on that."
          ],
          "responses": [
              "So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself.",
              "One effective strategy is to take a step back and try to clear your mind. This can help you approach the issue with a fresh perspective.",
              "It's important to give yourself some space to relax. Stressing over a problem can make it seem bigger than it is.",
              "Consider taking a break and engaging in a relaxing activity. This can help reduce stress and make it easier to think clearly.",
              "Sometimes, stepping away from the problem for a while can provide new insights when you return to it.",
              "Taking a moment to breathe and relax can help clear your mind and make it easier to tackle the problem.",
              "It's often helpful to take a break and focus on something else. This can give your brain a chance to reset.",
              "Giving yourself a mental break can be very beneficial. Try doing something you enjoy to take your mind off the issue.",
              "Stepping away from the problem can provide you with a new perspective when you come back to it.",
              "It's a good idea to take a break and do something relaxing. This can help reduce stress and improve your focus.",
              "Taking time for yourself is important. Engage in activities that you find calming and enjoyable.",
              "Sometimes the best way to solve a problem is to stop thinking about it for a while and let your subconscious work on it.",
              "Taking a break and engaging in a different activity can help you return to the problem with a clearer mind.",
              "It's helpful to give yourself some time away from the problem. This can help reduce stress and improve your ability to think clearly.",
              "Taking a step back can often provide new insights and make the problem seem less daunting.",
              "Consider taking a short break and doing something you enjoy. This can help you relax and approach the problem with a fresh mind.",
              "Giving yourself some time to relax can be very beneficial. Try to take your mind off the problem for a bit.",
              "It's important to take breaks and allow yourself to relax. This can help you return to the problem with a new perspective.",
              "Taking a break can help you clear your mind and come up with new solutions to the problem.",
              "Consider stepping away from the problem for a while. This can help you relax and think more clearly.",
              "It's often helpful to take a break and do something relaxing. This can reduce stress and help you focus better.",
              "Giving yourself some time to relax can help you return to the problem with a clearer mind.",
              "Taking a break can provide you with a fresh perspective and make the problem seem more manageable.",
              "Consider taking a step back and doing something you enjoy. This can help reduce stress and improve your ability to think clearly.",
              "Giving yourself a break can be very beneficial. Try to engage in a relaxing activity to take your mind off the problem.",
              "It's important to take time for yourself and relax. This can help you return to the problem with a fresh perspective.",
              "Taking a break can help you clear your mind and approach the problem with new insights.",
              "Consider stepping away from the problem for a while. This can help you relax and think more clearly.",
              "It's often helpful to take a break and focus on something else. This can reduce stress and improve your focus.",
              "Giving yourself some time to relax can help you return to the problem with a clearer mind.",
              "Taking a break can provide you with a fresh perspective and make the problem seem less daunting."
          ]
      },
      {
          "tag": "user-agree",
          "patterns": [
              "yeah you're right. I deserve a break.",
              "Yeah you're absolutely right about that",
              "You're correct, I need to take a break.",
              "That makes sense, I should take some time for myself.",
              "I agree, I could use a break.",
              "You're right, I should give myself some time to relax.",
              "I see your point, I should take a step back and rest.",
              "That's a good idea, I need to take care of myself.",
              "I agree, I should prioritize my well-being.",
              "You're right, I need to practice self-care.",
              "I agree, I should focus on my mental health.",
              "That sounds reasonable, I need to take a break.",
              "I agree, I should try to reduce my stress levels.",
              "You're right, I need to unwind and relax.",
              "I see what you mean, I should take some time off.",
              "That's true, I need to prioritize my own needs.",
              "You're correct, I should listen to my body and rest.",
              "I agree, I should take some time to recharge.",
              "That makes sense, I need to give myself permission to relax.",
              "You're right, I should practice self-compassion.",
              "I agree, I should take a break to avoid burnout.",
              "You're correct, I need to focus on my well-being.",
              "I see your point, I should prioritize my mental health.",
              "That's a good point, I need to practice self-care.",
              "I agree, I should take some time to de-stress.",
              "You're right, I should prioritize relaxation."
          ],
          "responses": [
              "Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind.",
              "You're on the right track! Incorporating meditation into your routine can help you find inner peace and reduce stress.",
              "That's a great decision! Meditation can be a powerful tool for improving mental clarity and overall well-being.",
              "I'm glad you agree! Meditation has numerous benefits, including stress reduction and increased mindfulness.",
              "Absolutely! Meditation can be a valuable practice for promoting relaxation and inner balance.",
              "You're spot on! Meditation can help calm the mind and promote a sense of serenity and well-being.",
              "I completely agree! Practicing meditation regularly can help you cultivate a sense of inner peace and calm.",
              "You're absolutely right! Meditation can be a wonderful way to de-stress and enhance your overall quality of life.",
              "Spot on! Incorporating meditation into your daily routine can have profound effects on your mental and emotional well-being.",
              "That's a wise decision! Meditation can help you unwind, de-stress, and find greater inner peace.",
              "You're absolutely correct! Meditation offers a myriad of benefits for both the mind and body.",
              "I couldn't agree more! Meditation can be a powerful tool for managing stress and promoting relaxation.",
              "You're right on target! Meditation can provide a sanctuary for the mind and promote a sense of tranquility and balance.",
              "Precisely! Meditation can help you cultivate a deeper connection with yourself and find inner peace.",
              "Absolutely! Practicing meditation regularly can help you navigate life's challenges with greater ease and clarity.",
              "You're absolutely right! Meditation can be a valuable practice for promoting overall well-being and inner harmony.",
              "Spot on! Incorporating meditation into your daily routine can help you cultivate a sense of calm and balance amidst life's chaos.",
              "That's a great perspective! Meditation can offer a refuge from stress and turmoil, allowing you to reconnect with your inner peace.",
              "You're absolutely correct! Meditation can provide a sanctuary for the mind and foster a deep sense of relaxation and tranquility.",
              "I couldn't agree more! Meditation is a wonderful tool for reducing stress, enhancing self-awareness, and promoting inner peace.",
              "You're right on target! Meditation can help you cultivate a greater sense of mindfulness and presence in your daily life."
          ]
      },
      {
          "tag": "meditation",
          "patterns": [
              "hmmm that sounds like it could be useful to me.",
              "That sounds useful.",
              "I think I could benefit from that.",
              "Interesting, I might give that a try.",
              "I've never tried meditation before, but I'm willing to give it a shot.",
              "I've heard about meditation, but I'm not sure how to start.",
              "Meditation seems intriguing, but I'm not sure if it's for me.",
              "I'm curious about meditation, but I'm not sure where to begin.",
              "I've been feeling stressed lately. Do you think meditation could help?",
              "I've been looking for ways to relax. Could meditation be a good option?",
              "I've heard meditation can improve focus and concentration. Is that true?",
              "I'm open to trying new things. How do you recommend I start with meditation?",
              "I've been struggling with anxiety. Can meditation help calm my mind?"
          ],
          "responses": [
              "Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing.",
              "Find a comfortable and quiet place to sit or lie down. Close your eyes and take a few deep breaths to relax your body and mind. Allow your thoughts to come and go without judgment, gently bringing your focus back to your breath whenever you get distracted.",
              "Start with just a few minutes of meditation each day, gradually increasing the duration as you become more comfortable with the practice. Remember, consistency is key!",
              "Experiment with different meditation techniques to find what works best for you. Whether it's focused attention, mindfulness, loving-kindness, or transcendental meditation, explore various approaches to discover what resonates with you.",
              "Don't worry if your mind wanders during meditation. It's natural for thoughts to arise. Simply acknowledge them without attachment and gently guide your awareness back to the present moment.",
              "Use guided meditation recordings or apps to support your practice. These resources often provide instructions and soothing music or sounds to help you relax and focus.",
              "Incorporate meditation into your daily routine by setting aside dedicated time each day for practice. Whether it's in the morning, during your lunch break, or before bed, find a time that works for you and stick to it.",
              "Practice self-compassion and patience as you explore meditation. It's okay to have days where your mind feels busy or restless. The important thing is to show up and practice regularly, regardless of how you're feeling.",
              "Celebrate your progress and the benefits you experience from meditation, no matter how small they may seem. Whether it's increased relaxation, improved focus, or greater emotional resilience, acknowledge and appreciate the positive changes in your life.",
              "Consider joining a meditation group or class to deepen your practice and connect with like-minded individuals. Sharing your meditation journey with others can offer support, encouragement, and inspiration.",
              "Explore resources such as books, articles, podcasts, and videos on meditation to deepen your understanding and inspire your practice. There's a wealth of information available to support you on your meditation journey.",
              "Experiment with different meditation postures to find what feels most comfortable for you. Whether you sit cross-legged on the floor, use a meditation cushion or bench, or practice lying down, choose a position that allows you to relax and remain alert.",
              "Create a calming environment for your meditation practice by dimming the lights, lighting a candle or incense, and removing distractions such as electronic devices. Cultivating a serene atmosphere can enhance your meditation experience.",
              "Set an intention for your meditation practice, whether it's to cultivate inner peace, reduce stress, enhance self-awareness, or deepen your spiritual connection. Clarifying your intention can help focus your mind and guide your practice.",
              "Incorporate mindfulness into your daily activities by bringing your full attention to the present moment. Whether you're eating, walking, or washing dishes, engage fully in the experience without judgment or distraction.",
              "Experiment with different times of day for meditation to see what works best for you. Some people prefer to meditate in the morning to start their day with clarity and calm, while others find evening meditation helps them unwind and prepare for sleep.",
              "Explore outdoor meditation practices to connect with nature and experience a sense of spaciousness and tranquility. Whether it's walking meditation in a park or sitting meditation by a lake, spending time in nature can deepen your meditation experience.",
              "Practice gratitude as part of your meditation practice by reflecting on the blessings in your life and expressing appreciation for them. Cultivating an attitude of gratitude can foster feelings of contentment and joy.",
              "Experiment with incorporating movement into your meditation practice through practices such as yoga, tai chi, or qigong. Moving meditation can help cultivate mindfulness, balance, and relaxation.",
              "Use visualization techniques during meditation to evoke feelings of peace, healing, or abundance. Whether it's imagining a tranquil beach scene, a radiant light filling your body, or achieving your goals, visualization can be a powerful tool for transformation.",
              "Experiment with different breathing techniques during meditation to calm the mind and body. Whether it's diaphragmatic breathing, alternate nostril breathing, or breath counting, explore various methods to find what resonates with you.",
              "Practice loving-kindness meditation to cultivate compassion and empathy towards yourself and others. Start by directing loving-kindness towards yourself, then extend it to loved ones, acquaintances, and even those you have difficulty with.",
              "Use music or soundscapes to enhance your meditation experience by creating a soothing and harmonious atmosphere. Whether it's nature sounds, chanting, or instrumental music, find sounds that resonate with you and support your practice."
          ]
      },
      {
          "tag": "user-meditation",
          "patterns": [
              "i did what you said and i feel a lot better. thank you very much.",
              "I feel better now",
              "I followed your advice and I'm feeling much more relaxed.",
              "Thank you for the meditation tips. I'm noticing a positive difference in my mood.",
              "I practiced meditation as you suggested and it really helped calm my mind.",
              "Your meditation advice was spot on! I feel more centered and grounded now.",
              "I'm amazed at how much better I feel after incorporating meditation into my daily routine.",
              "Meditation has become an essential part of my self-care routine thanks to your guidance.",
              "I've been struggling with stress lately, but meditation has been a game-changer for me.",
              "Your meditation tips have helped me find a sense of peace and tranquility amidst chaos.",
              "I never realized how much of an impact meditation could have on my overall well-being until I tried it.",
              "I've been sleeping better since I started meditating regularly. Thank you for the suggestion.",
              "Meditation has helped me become more mindful and present in my everyday life. I can't thank you enough for introducing me to it.",
              "Your meditation advice came at just the right time. It's been incredibly helpful in managing my anxiety.",
              "I'm starting to feel more connected to myself and others since I started practicing meditation.",
              "Thank you for encouraging me to give meditation a try. It's been a transformative experience.",
              "I'm amazed by how much clarity I've gained through meditation. Thank you for showing me the way.",
              "I feel like I have a better handle on my emotions now that I've incorporated meditation into my routine.",
              "Meditation has become my go-to tool for reducing stress and finding inner peace. I'm so grateful for your guidance.",
              "Your meditation tips have helped me find a sense of balance and harmony in my life.",
              "I've noticed a significant improvement in my focus and concentration since I started meditating regularly.",
              "I feel like I'm better equipped to handle life's challenges now that I have a regular meditation practice.",
              "Thank you for teaching me how to incorporate mindfulness into my daily life through meditation.",
              "I feel more resilient and adaptable to change since I began practicing meditation.",
              "Your meditation advice has helped me cultivate a greater sense of gratitude and appreciation for life.",
              "I've been feeling more creative and inspired since I started meditating regularly. Thank you for the encouragement.",
              "I'm experiencing a deeper sense of connection with myself and the world around me thanks to meditation.",
              "Meditation has helped me become more patient and compassionate towards myself and others.",
              "I feel like I'm living with more intention and purpose now that I've embraced meditation."
          ],
          "responses": [
              "I'm glad the meditation practice brought you relief. Remember to be patient with yourself as you continue your journey of self-care.",
              "That's wonderful to hear! Keep incorporating mindfulness into your daily life, and you'll continue to see positive changes.",
              "You're welcome! I'm glad the meditation practice helped you feel better. Remember to prioritize your well-being and listen to your body's signals.",
              "I'm thrilled to hear that the meditation practice had a positive impact on you. Remember, taking care of yourself is essential for living a fulfilling life.",
              "You're welcome! I'm so glad the meditation practice brought you relief. Remember to celebrate your progress along the way.",
              "I'm delighted to hear that the meditation practice made a difference for you. Remember to give yourself credit for taking proactive steps towards self-care.",
              "That's fantastic news! Keep up the self-care routine, and don't hesitate to reach out if you need additional support or guidance.",
              "You're welcome! I'm glad the meditation practice helped you find peace and tranquility. Remember, self-care is an ongoing journey.",
              "I'm thrilled to hear that you're feeling more centered and grounded. Remember to honor your body and mind's need for relaxation and rejuvenation.",
              "That's wonderful to hear! Keep exploring mindfulness practices, and remember that there's no one-size-fits-all approach to self-care.",
              "You're welcome! I'm so glad the meditation practice has become a valuable tool for managing stress. Remember to prioritize your mental health.",
              "I'm delighted to hear that the meditation practice has become an essential part of your self-care routine. Remember to listen to your body's needs.",
              "That's fantastic news! Keep up the good work, and remember that self-care isn't selfishit's necessary for maintaining overall well-being.",
              "You're welcome! I'm thrilled that the meditation practice has brought you relief. Remember to approach each day with mindfulness and compassion.",
              "I'm so happy to hear that the meditation practice has helped you feel more connected. Remember, you're not alone on your journey towards wellness.",
              "That's wonderful to hear! Keep embracing meditation as a tool for personal growth and self-discovery.",
              "You're welcome! I'm glad the meditation practice has helped you manage anxiety. Remember to practice self-compassion during difficult moments.",
              "I'm delighted to hear that the meditation practice has helped you become more mindful and present. Remember to savor each moment of your journey.",
              "That's fantastic news! Keep integrating meditation into your daily life, and remember that self-care is an ongoing practice.",
              "You're welcome! I'm thrilled to hear that the meditation practice has helped you find balance and harmony. Remember to prioritize your well-being.",
              "I'm so glad to hear that you're experiencing greater focus and concentration. Remember to be patient with yourself as you continue to grow."
          ]
      },
      {
          "tag": "Jug-useful",
          "patterns": [
              "Thank you once again for your advice. I'll make meditation a priority and concentrate on what I have the power to change.",
              "Your guidance has been invaluable. I'll continue practicing meditation and focus on the aspects of my life that I can influence.",
              "I'm grateful for your help. I'll incorporate meditation into my daily routine and shift my focus towards what I can control.",
              "Thanks for your support. I'll commit to meditation and redirect my energy towards the things I have power over.",
              "I appreciate your insights. I'll prioritize meditation and center my attention on the areas where I can make a difference.",
              "Thank you for your assistance. I'll stick to meditation and channel my efforts towards the aspects of my life that I can control.",
              "I'm thankful for your advice. I'll continue meditating and focus on what I have the ability to change.",
              "Thanks for your wisdom. I'll make meditation a regular practice and direct my focus towards what I can influence.",
              "Your suggestions are greatly appreciated. I'll maintain a meditation routine and concentrate on the aspects of life that I can manage.",
              "I'm thankful for your guidance. I'll stay committed to meditation and shift my focus to the things that are within my sphere of influence.",
              "Thank you for your valuable input. I'll keep up with meditation and redirect my attention towards what I have the power to impact.",
              "Thanks once again for your thoughtful advice. I'll continue to prioritize meditation and focus on what's within my control."
          ],
          "responses": [
              "I'm glad you found this useful. Is there something else I can help you with?",
              "It's great to hear that you're taking proactive steps towards well-being. Let me know if there's anything else I can assist you with.",
              "I'm pleased to hear that you're finding value in meditation. Feel free to reach out if you have any further questions or need additional support.",
              "It sounds like you're on the right track. If you ever need more guidance or resources on meditation, don't hesitate to ask.",
              "I'm glad I could provide helpful advice. If there's anything else you'd like to explore or discuss, feel free to let me know.",
              "It's wonderful to hear that you're committed to meditation. If you ever want to delve deeper into mindfulness practices or need encouragement, I'm here to help.",
              "I'm happy to hear that you're prioritizing meditation. If there's anything else you'd like to learn or discuss about mindfulness, feel free to reach out.",
              "I'm glad you're focusing on what's within your control. If there's anything else you need guidance on or want to explore, just let me know.",
              "It's great that you're channeling your energy towards positive change. If there's anything else I can assist you with, feel free to ask.",
              "I'm pleased that you're finding value in redirecting your focus. If there's anything else you'd like to discuss or learn about, feel free to reach out.",
              "It's wonderful to see you taking proactive steps towards self-improvement. Remember, progress takes time, and I'm here to support you along the way.",
              "I'm glad you're committed to prioritizing your well-being. Remember, self-care is an ongoing journey, and I'm here to help you navigate it.",
              "It's great to hear that you're incorporating meditation into your routine. Remember, consistency is key, and I'm here to provide encouragement whenever you need it."
          ]
      },
      {
          "tag": "user-advice",
          "patterns": [
              "I want some advice.",
              "I need some advice.",
              "I need advice on something.",
              "Can you give me some advice?",
              "I could use some advice.",
              "Can you help me with some advice?",
              "I have a question and need advice.",
              "I need guidance on something.",
              "Could you offer me some advice?",
              "What should I do about something?",
              "Can you advise me on something?",
              "I need your advice.",
              "Do you have any advice for me?",
              "I need some help and advice.",
              "Can you provide some advice?",
              "Can I ask for your advice?",
              "I need a recommendation.",
              "Could you guide me on something?",
              "Do you have any suggestions for me?",
              "I need your opinion on something.",
              "Can you give me your thoughts on something?",
              "Im looking for some advice.",
              "I need some input on something.",
              "Can you help me figure something out?",
              "I need some direction."
          ],
          "responses": [
              "Sure. What can I do to help?",
              "Okay, what do you need advice on?",
              "Of course, what advice are you looking for?",
              "Sure thing! What do you need advice about?",
              "I'm here to help. What do you need advice on?",
              "Absolutely! What do you need help with?",
              "I'd be happy to help. What's your question?",
              "What specifically do you need advice on?",
              "Sure, I'm here for you. What advice do you need?",
              "Let's see how I can help. What's on your mind?",
              "Of course. What's the advice you're looking for?",
              "I'm all ears. What advice do you need?",
              "Yes, I'm here to assist. What's your question?",
              "I'd be glad to offer advice. What do you need help with?",
              "Tell me more about what you need advice on.",
              "Sure, what can I assist you with?",
              "I'm here for you. What advice do you seek?",
              "How can I help you today?",
              "I'm ready to help. What do you need advice on?",
              "What can I do for you?",
              "Let's figure this out together. What's your question?",
              "I'm here to listen. What do you need advice on?"
          ]
      },
      {
          "tag": "learn-mental-health",
          "patterns": [
              "I want to learn about mental health.",
              "I want to learn more about mental health.",
              "I'm interested in learning about mental health.",
              "Can you teach me about mental health?",
              "I need information on mental health.",
              "Tell me about mental health.",
              "What can you tell me about mental health?",
              "I'm curious about mental health.",
              "Could you provide information on mental health?",
              "I want to understand mental health better.",
              "Can you help me learn about mental health?",
              "I'm looking for information on mental health.",
              "Explain mental health to me.",
              "I want to educate myself on mental health.",
              "Can you give me details about mental health?",
              "I'd like to know more about mental health.",
              "Help me learn about mental health.",
              "Can you share some insights on mental health?",
              "I want to gain knowledge about mental health.",
              "Can you tell me more about mental health?",
              "I'm interested in mental health information.",
              "I want to know about mental health."
          ],
          "responses": [
              "Oh that's really great. I'd be willing to answer anything that I know about it.",
              "Sure, I'd be happy to share what I know about mental health.",
              "Absolutely, what specific aspect of mental health are you interested in?",
              "That's wonderful! Ask me anything you want to know about mental health.",
              "Mental health is a vital topic. What would you like to learn about?",
              "Of course, feel free to ask me anything about mental health.",
              "I can definitely help with that. What do you want to know about mental health?",
              "Great to hear you're interested in mental health! What questions do you have?",
              "I'd be glad to help you learn about mental health. What would you like to know?",
              "Mental health is so important. What specific information are you looking for?",
              "Yes, I can provide information on mental health. What are you curious about?",
              "Let's talk about mental health. What do you want to learn?",
              "I'm here to help you understand mental health better. What do you need to know?",
              "It's great that you're interested in mental health. How can I assist?",
              "I'd love to share information on mental health. What would you like to ask?",
              "Sure thing! What aspects of mental health are you interested in?",
              "Mental health is an important topic. What do you want to know more about?",
              "Ask me anything about mental health. I'll do my best to answer.",
              "I'm here to help with your mental health questions. What do you need to know?",
              "It's fantastic that you want to learn about mental health. What can I help with?"
          ]
      },
      {
          "tag": "mental-health-fact",
          "patterns": [
              "Tell me a fact about mental health",
              "Tell me another fact about mental health",
              "Share a mental health fact",
              "Give me a mental health fact",
              "Can you tell me a mental health fact?",
              "I'd like to hear a mental health fact",
              "What is a fact about mental health?",
              "Do you have a mental health fact?",
              "Provide a fact about mental health",
              "Share another fact about mental health",
              "Tell me an interesting fact about mental health",
              "Can you share a mental health fact?",
              "Give me an interesting fact about mental health",
              "Tell me a surprising fact about mental health",
              "I want to know a fact about mental health",
              "Whats a fact about mental health?",
              "Tell me a notable fact about mental health",
              "Do you know a fact about mental health?",
              "What is an interesting fact about mental health?",
              "Can you share some facts about mental health?",
              "Tell me something interesting about mental health"
          ],
          "responses": [
              "According to a UNICEF report, one in seven Indians between 15-24 years of age feels depressed.",
              "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.",
              "Depression is the leading cause of disability worldwide.",
              "Anxiety disorders are the most common mental illness in the U.S., affecting 40 million adults in the United States age 18 and older.",
              "Only 41% of people who had a mental disorder in the past year received professional health care or other services.",
              "Approximately 264 million people worldwide suffer from depression.",
              "Bipolar disorder affects about 45 million people worldwide.",
              "Suicide is the second leading cause of death among 15-29-year-olds globally.",
              "Mental health conditions account for 16% of the global burden of disease and injury in people aged 10-19 years.",
              "The global economy loses about $1 trillion per year in productivity due to depression and anxiety.",
              "Half of all mental health conditions start by 14 years of age but most cases are undetected and untreated.",
              "Women are more likely to be diagnosed with anxiety or depression, while men are more likely to be diagnosed with substance abuse disorders.",
              "Schizophrenia affects more than 21 million people worldwide.",
              "Mental health issues can reduce life expectancy by up to 20 years."
          ]
      },
      {
          "tag": "fact-1",
          "patterns": [
              "What is mental health?",
              "Define Mental Health"
          ],
          "responses": [
              "Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community",
              "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."
          ]
      },
      {
          "tag": "fact-2",
          "patterns": [
              "Why is mental health important?",
              "What is the importance of mental health?"
          ],
          "responses": [
              "Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."
          ]
      },
      {
          "tag": "fact-3",
          "patterns": [
              "What is Depression?",
              "Define Depression"
          ],
          "responses": [
              "A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."
          ]
      },
      {
          "tag": "fact-5",
          "patterns": [
              "How do i know if i have Depression?",
              "Am i depressed?",
              "Am i suffering from depression?",
              "Am i mentally ill?"
          ],
          "responses": [
              "For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."
          ]
      },
      {
          "tag": "fact-6",
          "patterns": [
              "What is a therapist?",
              "What does a therapist do?"
          ],
          "responses": [
              "A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "
          ]
      },
      {
          "tag": "fact-7",
          "patterns": [
              "What is therapy?",
              "Do i need therapy?",
              "Who is therapy for?"
          ],
          "responses": [
              "Therapy is a form of treatment that aims to help resolve mental or emotional issues.",
              "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."
          ]
      },
      {
          "tag": "fact-8",
          "patterns": [
              "What does it mean to have a mental illness?"
          ],
          "responses": [
              "Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."
          ]
      },
      {
          "tag": "fact-9",
          "patterns": [
              "Who does mental illness affect?"
          ],
          "responses": [
              "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childs mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
          ]
      },
      {
          "tag": "fact-10",
          "patterns": [
              "What causes mental illness?"
          ],
          "responses": [
              "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
          ]
      },
      {
          "tag": "fact-11",
          "patterns": [
              "What are some of the warning signs of mental illness?"
          ],
          "responses": [
              "Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"
          ]
      },
      {
          "tag": "fact-12",
          "patterns": [
              "Can people with mental illness recover?"
          ],
          "responses": [
              "When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."
          ]
      },
      {
          "tag": "fact-13",
          "patterns": [
              "What should I do if I know someone who appears to have the symptoms of a mental disorder?"
          ],
          "responses": [
              "Although Pandora cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."
          ]
      },
      {
          "tag": "fact-14",
          "patterns": [
              "How can I find a mental health professional for myself or my child?"
          ],
          "responses": [
              "Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."
          ]
      },
      {
          "tag": "fact-15",
          "patterns": [
              "What treatment options are available?"
          ],
          "responses": [
              "Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."
          ]
      },
      {
          "tag": "fact-16",
          "patterns": [
              "If I become involved in treatment, what do I need to know?"
          ],
          "responses": [
              "Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"
          ]
      },
      {
          "tag": "fact-17",
          "patterns": [
              "What is the difference between mental health professionals?"
          ],
          "responses": [
              "There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."
          ]
      },
      {
          "tag": "fact-18",
          "patterns": [
              "How can I find a mental health professional right for my child or myself?"
          ],
          "responses": [
              "Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."
          ]
      },
      {
          "tag": "fact-19",
          "patterns": [
              "Where else can I get help?"
          ],
          "responses": [
              "Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."
          ]
      },
      {
          "tag": "fact-20",
          "patterns": [
              "What should I know before starting a new medication?"
          ],
          "responses": [
              "The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."
          ]
      },
      {
          "tag": "fact-21",
          "patterns": [
              "Where can I go to find therapy?"
          ],
          "responses": [
              "Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrens mental health). However, there are several different types of treatment and therapy that can help."
          ]
      },
      {
          "tag": "fact-22",
          "patterns": [
              "Where can I learn about types of mental health treatment?"
          ],
          "responses": [
              "Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."
          ]
      },
      {
          "tag": "fact-23",
          "patterns": [
              "What are the different types of mental health professionals?"
          ],
          "responses": [
              "There are many types of mental health professionals. Finding the right one for you may require some research."
          ]
      },
      {
          "tag": "fact-24",
          "patterns": [
              "Where can I go to find a support group?"
          ],
          "responses": [
              "Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."
          ]
      },
      {
          "tag": "fact-25",
          "patterns": [
              "Can you prevent mental health problems?"
          ],
          "responses": [
              "We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."
          ]
      },
      {
          "tag": "fact-26",
          "patterns": [
              "Are there cures for mental health problems?",
              "is there any cure for mental health problems?"
          ],
          "responses": [
              "It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."
          ]
      },
      {
          "tag": "fact-27",
          "patterns": [
              "What causes mental health problems?"
          ],
          "responses": [
              "Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."
          ]
      },
      {
          "tag": "fact-28",
          "patterns": [
              "What do I do if I'm worried about my mental health?"
          ],
          "responses": [
              "The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."
          ]
      },
      {
          "tag": "fact-29",
          "patterns": [
              "How do I know if I'm unwell?"
          ],
          "responses": [
              "If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."
          ]
      },
      {
          "tag": "fact-30",
          "patterns": [
              "How can I maintain social connections? What if I feel lonely?"
          ],
          "responses": [
              "A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."
          ]
      },
      {
          "tag": "fact-31",
          "patterns": [
              "What's the difference between anxiety and stress?"
          ],
          "responses": [
              "Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."
          ]
      },
      {
          "tag": "fact-32",
          "patterns": [
              "What's the difference between sadness and depression?",
              "difference between sadness and depression"
          ],
          "responses": [
              "Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."
          ]
      }
  ]
}